package com.example.ahmedyehia.myapplication;

import android.graphics.Typeface;
import android.graphics.Xfermode;
import android.support.v7.app.AppCompatActivity;
import android.os.Bundle;
import android.widget.TextView;

public class Firstbook1 extends AppCompatActivity {

    TextView text1 , text2 , text3 , text4, text5, text6 ,text7;
    Typeface myfont;

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_firstbook1);
        myfont = Typeface.createFromAsset(this.getAssets(),"fonts/me_quran_volt_newmet.ttf");
        text1 = (TextView)findViewById(R.id.text1);
        text2 = (TextView)findViewById(R.id.text2);
        text3 = (TextView)findViewById(R.id.text3);
        text4 = (TextView)findViewById(R.id.text4);
        text5 = (TextView)findViewById(R.id.text5);
        text6 = (TextView)findViewById(R.id.text6);
        text7 = (TextView)findViewById(R.id.text7);

        text1.setText("نسبه ومولده وبدايته \n هو  على  بن  عبدالله  بن  عبدالجبار  ..  وينتهى  نسبه  إلى  الحسن  بن  على  بن  أبي  طالب  (593  –  656  هـ)  –  (1197  –  1258  م)  .\n" +
                "كان  مولده  سنة  593هـ  بقرية    غمارة    قرب  مدينة  سبته  الواقعة  على  بوغاز  جبل  طارق  من  بلاد  المغرب  الأقصى(أى  المغرب  حالياً)  .\n" +
                "وقد  حفظ  القرآن  الكريم  بها  وجوّده  عندما  بلغ  ستة  أعوام،  وتلقى  رضي  الله  عنه  الحديث  أيضاً  على  بعض  شيوخ  قريته .\n" +
                "ثم  اشتاق  وهو  صبي  إلى  علوم  القوم،  ..  فماذا  يفعل؟  ..رحل  إلى  مدينة  فاس،  وتلقى  مبادئ  الطريقة،  ولبس  خرقة  التصوف  على  يد  أبى  عبدالله  بن  الحسن  بن  حرازم  أحد  شيوخ  المغرب  والأندلس  المعدودين،  وله  شهرة  فائقة  في  التصوف،  وقد  توفي  ودفن  بالأهواز  بضواحى  فاس  633هـ .\n");
        text1.setTypeface(myfont);
        text2.setText("سياحته  فى  طلب  العلم\n ثم  تاقت  نفسه  إلى  الإستزادة  من  المعارف  ..  ولم  يكفه  ماحصل!!    فرحل  إلى    زرويلة    قرب  تونس  وعمره  عشر  سنوات  !!!.\n" +
                "وأخذ  عن  شيوخها  ثم  نزل    تونس    وتزود  من  علمائها.\n" +
                "يقول  الدكتور  جمال  الشيال:\n" +
                "  إنه  يبدو  أن  الجو  فى  تونس  كان  أصلح  منه  فى  المغرب  الأقصى،  وحرية  الفكر  والدراسة  كانت  مكفولة  هناك  إلى  حد  ما،  وفيها  آنذاك  كان  يقيم  عدد  كبير  من  أعلام  المتصوفة  من  أمثال  الشيخ  أبى  محمد  المهدوى،  والشيخ  أبى  سعيد  الباجى،  وقد  عاصر  الشاذلي  أثناء  تلقيه  العلم  فى  تونس،  هؤلاء  الأعلام،  ولا  شك  أنه  اتصل  بهم،  وتتلمذ  عليهم،  وأخذ  منهم  \n" +
                "وقد  تلقى  على  علمائها:\n" +
                "-\tعلوم  الشريعة.\n" +
                "-\t  وتفقه  على  مذهب  الإمام  مالك.\n" +
                "-\t  ودرس  علوم  الفقه.\n" +
                "-\tودرس  علوم  الأدب  والنحو  والصرف.\n" +
                "-\tودرس  علوم  التفسير  والحديث  وعلم  الكلام.\n" +
                "-\t  بل  وأخذ  عنهم  رضي  الله  عنهم  أيضاً  آداب  الطريقة،  ومبادئ  السلوك.\n" +
                "حتى  صار  حجة  فى  سائر  العلوم.\n" +
                "وفيه  قال  ابن  عطاء  الله  السكندرى  رضي  الله  عنه:    انه  لم  يدخل  طريق  القوم  حتى  كان  يعد  للمناظرة  فى  العلوم  الظاهرة  \n");
        text2.setTypeface(myfont);
        text3.setText("الرحلة  إلى  المشرق\nبيد  أن  هذه  العلوم  الظاهرة  مهما  بلغت  بها  الدقة،  ومهما  بلغ  بها  العمق،  لا  تفضى  بالنفوس  الطموحة  إلى  الكف  عن  التطلع  نحو  عالم  الغيب،  واستشراف  آلائه  وأنواره.\n" +
                "إن  النفوس  الطموحة  كلما  ازدادت  علماً،  ازدادت  شعوراً  بالنقص  ولقد  أمر  الله  رسوله  صلي  الله  عليه  وسلم  أن  يقول:\n" +
                "\uF07D  \uF0C9\uF062\uF03E\uF0A7\uF091  \uF092\uF0CE\uF054\uF0F7\uF08A\uF0CE\uF097  \uF024\uF056\uF04A\uF0F9\uF03D\uF0CF\uF0E3  \uF0C7\uF0CA\uF0CA\uF0CD\uF0C8    \uF07B  [طه]\n" +
                "شعر  أبو  الحسن  بالرغبة  الملحة  فى  القرب  من  الله،  وفي  أن  يستضيء  قلبه  بنور  المعرفة،  وفى  أن  يكشف  الله  له  الحجب،  فلما  أحس  أن  غلته  لم  تشف،  وأن  ظمأه  للعلم  والمعرفة  لم  يشبع،  اعتزم  الرحلة  إلى  الشرق،  لأداء  فريضة  الحج  وزيارة  الأرض  الطيبة  المقدسة  والقبر  الطاهر  أولاً،  ثم  لإتمام  علومه  واستكمال  دراسته  على  أيدي  شيوخ  الشرق  ثانيا،  ثم  البحث  عن  الشيخ  المرشد  ....  وهو  الأهم  ثالثاً.\n" +
                "بدأ  الشاذلي  رحلته  .....\n" +
                "فدخل  مدينة  الاسكندرية،  ومرّ  بأرض  مصر،  ثم  دخل  الحجاز  فأدى  الفريضة،  ثم  زار  فلسطين،  والشام،  والعراق.\n" +
                "وكان  فى  كل  بلد  يزوره  يقصد  مَنْ  بها  من  العلماء  والفقهاء  يأخذ  عنهم  ويستمع  إليهم؛  وإن  كان  أكثر  اتصاله  بالعبّاد  والزهاد  والمتصوفة.\n" +
                "وكان  أكثر  تأثره  فى  رحلته  هذه  بالشيخ  أبى  الفتح  الواسطى  رضي  الله  عنه،  وهو  من  أكابر  تلاميذ  سيدي  أحمد  الرفاعى،  وكانت  له  منزلة  عظيمة  عند  الرفاعية  مما  دعاهم  إلى  إرساله  إلى  مصر  ليعمل  على  نشر  طريقتهم  فيها،  ووصل  أبو  الفتح  إلى  الإسكندرية  فى  سنة  630،  وأقام  بها  مدة  يعظ  الناس  ويدعوهم  إلى  طريقته،  وكان  يلقى  دروسه  فى  مسجد  العطارين،  وقد  قامت  بينه  وبين  علماء  الاسكندرية  وفقهائها  مساجلات  ومناظرات  علمية  كثيرة  ،  وتوفى  بالاسكندرية  فى  سنة  632  ومازال  ضريحه  موجوداً  بالقرب  من  ضريح  أبى  الدرداء.\n" +
                "على  هذا  الشيخ  العالم  الكبير  أبى  الفتح  الواسطى  أخذ  الشاذلي  أثناء  مقامه  فى  العراق،  واعترف  أنه  لم  يلق  هناك  من  العلماء  من  هو  خير  منه  قال:\n" +
                "  دخلت  العراق،  ولقيت  جملة  من  المشايخ!  فلم  أر  أحسن  من  الشيخ  أبى  الفتح  الواسطى  .\n");
        text3.setTypeface(myfont);
        text4.setText("البحث  عن  القطب\nوقد  كان  الشاذلي  أثناء  سياحته  فى  بلدان  الشرق  لا  يسعى  لطلب  العلم  وحده،  ولكنه  كان  يبحث  عن  ضالته  المنشودة  !!!!\n" +
                "يبحث  عن  القطب  الغوث  ...  والذي  أشار  إليه  فى  حديثه  مع  أحد  تلاميذه  وهو  شمس  الدين  بن  كتيلة.\n" +
                "روى  ابن  كتيلة  أنه  كان  جالساً  يوماً  بين  يدي  أستاذه  الشاذلي  فخطر  له  أن  يسأله  عن  القطب  فقال  له:  يا  سيدي  ما  معنى  القطب؟،  فقال  الشاذلي:\n" +
                "  الأقطاب  كثيرة،  فإن  كل  مقدم  قوم  هو  قطبهم،  أما  القطب  الغوث  الفرد  الجامع  فهو  واحد  .\n" +
                "وقد  عرَّف  صاحب    المفاخر  العلية    القطب  الغوث  بأنه:\n" +
                "    رجل  عظيم  وسيد  كريم،  يحتاج  الناس  إليه  عند  الإضطرار  فى  تبيين  ما  خفى  من  العلوم  المبهمة  والأسرار،  ويطلب  منه  الدعاء  لأنه  مستجاب  الدعاء،  لو  أقسم  على  الله  لأبره،  ولا  يكون  القطب  قطباً  حتى  تجتمع  فيه  جميع  صفات  الأقطاب  الذين  هو  رئيسهم  .\n" +
                "وقد  بين  الإمام  الشاذلي  رضي  الله  عنه  خصوصيات  القطب  الروحانية  فقال:\n" +
                "    للقطب  خمس  عشرة  كرامة،  فمن  ادّعى  شيئاً  منها  فليبرز:  يُمَدُّ  بمدد  الرحمة،  والعصمة،  والإنابة،  والنيابة،  ومدد  حملة  العرش،  ويكشف  له  عن  حقيقة  الذات،  وإحاطة  الصفات؛  ويكرم  بكرامة  الحكم،  والفصل  بين  الموجودين،  وانفعال  الأول  عن  الأول،  وما  انفصل  عنه،  وما  ثبت  فيه،  وحكم  ما  قبل،  وحكم  ما  لا  قبل  ولا  بعد،  وعلم  البدء  وهو  العلم  المحيط  بكل  عالم  وبكل  معلوم،  بدءاً  من  السر  الأول  إلى  منتهاه  ثم  يعود  إليه  \n" +
                "عن  هذا  القطب  كان  يبحث  الشاذلي  أثناء  سياحته  فى  الشرق.\n" +
                "ولذا  ...  لما  اطمأنت  نفسه  إلى  الشيخ  أبى  الفتح  الواسطى  أخبره  بما  فى  نفسه،  وحدّثه  عن  أمنيته،  ويصف  الشاذلي  ما  دار  في  هذه  المقابلة  مع  الشيخ  أبى  الفتح  الواسطى  فيقول:  ....    وكنت  أطلب  القطب  فقال  لي:\n" +
                "    أتطلب  يا  علي  القطب  بالعراق  وهو  ببلاد  المغرب؟....  ارجع  إلى  المغرب!  فإنك  تجد  القطب  هناك  ،  قال:    فرجعت  إلى  المغرب  ....  واجتمعت  بأستاذي  عبدالسلام  بن  مشيش  .\n");
        text4.setTypeface(myfont);

        text5.setText("فى  صحبة  إبن  مشيش  رضي  الله  عنه\nوعلى  ذلك  عاد  أبوالحسن  من  حيث  أتى  ...!!!  عاد  يحدوه  الأمل،  ويغمره  الرجاء  ...  وكانت  رحلة  العودة  طويلة  وشاقة.\n" +
                "وبعدها  قابل  أستاذه  القطب  سيدي  عبدالسلام  بن  مشيش،  وكانت  مقابلته  الأولى  فى  رأس  جبل!  حيث  يقيم  ابن  مشيش  مرابطاً  ومتفرغاً  للعبادة،  وقد  روى  الشاذلي  خبر  هذه  المقابلة  ..  فقال:\n" +
                "  لما  قدمت  عليه  وهو  ساكنٌ  بمغارة  فى  رأس  جبل،  اغتسلت  فى  عين  بأسفل  ذلك  الجبل،  وخرجت  عن  علمي  وعملي،  وطلعت  إليه  فقيراً،  وإذا  به  هابطاً  إلي،  وعليه  مرقعة،  وعلى  رأسه  قلنسوة  من  خوص،  فقال  لي:\n" +
                "مرحباً  بعلي  بن  عبدالله  بن  عبدالجبار،  وذكر  نسبى  إلى  رسول  الله  صلي  الله  عليه  وسلم،  ثم  قال  لي:  ....  يا  علي  طلعت  إلينا  فقيراً  من  علمك  وعملك،  فأخذت  منا  غنى  الدنيا  والآخرة،  وسنروى  القصة  بتفصيل  فى  موضع  آخر.\n" +
                "قال:  فأخذني  منه  الدهش،  فأقمت  عنده  أياماً  إلى  أن  فتح  الله  على  بصيرتي،  ورأيت  له  خوارق  عادات  وكرامات.\n" +
                "ولزم  الشاذلي  أستاذه  ملازمة  تامة  منذ  هذه  اللحظة  ...  يأخذ  عنه  ..  ويتتلمذ  على  يديه  ..  أخذ  عنه  حب  الله  ..  والفناء  في  هذا  الحب  ...  وقد  قال  فى  ذلك  له:\n" +
                "  أدمن  على  الشرب  والمحبة  وكأسهما  مع  السكر  والصحو  ...،  كلما  أفقت  أو  تيقظت  شربت  ...،  حتى  يكون  سكرك  به  ...،  وحتى  تغيب  بجماله  عن  المحبة  وعن  الشرب  والشراب  والكأس  !!!،  بما  يبدو  لك  من  نور  جماله  وقدس  كماله  وجلاله  .\n" +
                "ورسّخ  فى  قلبه  الإيمان  القوى  الكلى  بالله  حتى  أوصله  إلى  مقام  قال  له  ابن  مشيش  رضي  الله  عنه  فيه:\n" +
                "  انظر  ببصر  الإيمان  تجد  الله  فى  كل  شيء،  وعند  كل  شيء،  ومع  كل  شيء،  وقبل  كل  شيء،  وبعد  كل  شيء،  وفوق  كل  شيء،  وتحت  كل  شيء،  وقريبا  من  كل  شيء،  ومحيطا  بكل  شيء،  بقرب  هو  وصفه،  وبحيطة  هي  نعته،  وعدّ  عن  الظرفية  والحدود،  وعن  الأماكن  والجهات،  وعن  الصحبة  والقرب  بالمسافات،  وعن  الدور  بالمخلوقات،  وامح  الكل  بوصفه  الأول  والآخر  والظاهر  والباطن،  وهو  هو  هو  كان  الله  ولا  شيء  معه،  وهو  الآن  على  ما  عليه  كان  .\n" +
                "بهذه  المبادئ  الروحانية  العليا  التى  تنادى  العبد  بأن  يقبل  على  حب  الله  وأن  يفنى  فى  هذا  الحب  ...  أقبل  الشاذلي  على  الله  صرفاً  ،  فقد  قال  رضي  الله  عنه:      سألت  أستاذي  –  رحمه  الله  –  عن  ورد  المحققين،  فقال:\n" +
                "    عليك  بإسقاط  الهوى،  ومحبة  المولى،  وآية  المحبة  ألا  يشتغل  محبٌّ  بغير  محبوبه  .\n" +
                "وأقبل  كذلك  على  تصفية  نفسه  وتطهيرها  عاملاً  بقول  شيخه:\n" +
                "  الزم  الطهارة  من  الشرك    ...كلما  أحدثت  تطهرت  من  دنس  حب  الدنيا  ...  وكلما  ملت  إلى  الشهوة  أصلحت  بالتوبة  ما  أفسدت  بالهوى  أو  كدت  .\n" +
                "فلما  صفت  نفسه،  وأصبح  أهلاً  للولاية  ووراثة  القطبانية  ..  أمره  أستاذه  أن  يرحل  إلى  تونس،  وتنبأ  له  بما  سيحدث  له  .\n");
        text5.setTypeface(myfont);
        text6.setText("الشيخ  عبدالسلام  بن  بشيش\nمن  هو  هذا  القطب؟\n" +
                "إنه  الولى  الكبير  سيدنا  عبدالسلام  بن  مشيش  (  أو  بشيش  )،  سلك  الطريق  إلى  الله  منذ  أن  كان  عمره  سبع  سنين،  وبعد  أن  سار  فى  العبادة  أشواطاً  وبلغ  مبلغ  الفتيان،  ظهر  له  من  الكشف  أمثال  الجبال،  وهو  ما  زال  بعد  فى  بواكير  شبابه.\n" +
                "ثم  خرج  إلى  السياحة  وأقام  فى  السياحة  ست  عشرة  سنة  كاملة،  ومما  وقع  له  أثناء  سياحته  أنه  بات  ليلة  فى  مغارة،  وبينما  هو  يتعبد،  إذ  رأى  شيخاً  يدخل  عليه  المغارة،  فقال  له:  من  أنت؟  ..  فقال  الشيخ:\n" +
                "  أنا  شيخك،  منذ  أن  كنت  ابن  سبع  سنين،  وكل  ما  كان  يصلك  من  النازلات  فهو  منّي،  وهي  كذا  وكذا  .\n" +
                "فحدثه  بجميع  ما  جرى  له  من  الأمور،  وشيخه  الذي  حدّث  عنه  هو  سيدي    عبدالرحمن  بن  الحسين  المدنى  الشريف،  المدعو    بالزيات    سكناه  بحارة  الزياتين  بالمدينة  المنورة  على  ساكنها  أفضل  الصلاة  والسلام،  فهو  إذاً  كما  قال  بعض  معاصريه:\n" +
                "  توارى  عن  الأعين  !!،  وتباعد  عن  الظهور!!،  وتجرد  للعبادة  !!،  وفر  بنفسه  عما  الناس  فيه  من  الفتن  !!،  وغاب  عن  الخلق  في  شهود  جلال  الحق  \n" +
                "ومما  يدل  على  بعض  ذلك  ما  قاله  الشيخ    أبى  الحسن  الشاذلى  :\n" +
                "    كنت  فى  سياحتي،  فأتيت  إلى  غار  لأبيت  فيه،  فسمعت  فيه  حسَّ  رجل،  فقلت:  والله  لا  أشوش  عليه  في  هذه  الليلة،  فبت  على  فم  الغار،  فلما  كان  عند  السحر  سمعته  يقول:  \n" +
                "    اللهم  إن  أقواماً  سألوك  إقبال  الخلق  عليهم،  وتسخيرهم  لهم،  فسخرت  لهم  خلقك،  فرضوا  منك  بذلك،  اللهم  إنى  أسألك  إعراضهم  عني،  وإعوجاجهم  عليَّ،  حتى  لا  يكون  لي  ملجأ  إلا  إليك    .\n" +
                "قال:  ثم  خرج،  فإذا  هو  أستاذي  (ابن  مشيش  )  فقلت  له:  يا  سيدي،  إني  سمعتك  البارحة  تقول:  كذا  وكذا،  فقال  لي:\n" +
                "    يا  علي،  أيما  خير  لك  أن  تقول:  كن  لي،  أو  تقول:  سخِّر  لي  قلوب  خلقك؟  ..  فإذا  كان  لك،  كان  لك  كل  شيء  .\n" +
                "ولعل  مما  يفسر  حبه  –أى  الشيخ  ابن  مشيش–  أيضاً  –  للخلوة،  وصيته  لأبى  الحسن  رضى  الله  عنهما  حينما  قال  له  يوما  ما:  أوصني!،  قال:\n" +
                "    اهرب  من  خير  الناس،  أكثر  مما  تهرب  من  شرهم،  فإن  شرهم  يصيبك  في  بدنك،  وخيرهم  يصيبك  في  قلبك،  ولأن  تصاب  فى  بدنك  خير  لك  من  أن  تصاب  في  قلبك  .\n" +
                "وكذلك  حينما  أوشك  أبوالحسن  الشاذلى  على  فراق  شيخه  وقال  له:    يا  سيدي  أوصني  ،  فأجابه  قائلاً:\n" +
                "    يا  علي!  الله  الله!  والناس  الناس!  نزه  لسانك  عن  ذكرهم،  وقلبك  عن  التمايل  من  قبلهم!،  وعليك  بحفظ  الجوارح،  وأداء  الفرائض،  وقد  تمت  ولاية  الله  عندك!،  ولا  تذكرهم  إلا  بواجب  هو  لله  عليك،  وقد  تم  ورعك،  وقل:  اللهم  أرحنى  من  ذكرهم،  ومن  العوارض  من  قبلهم،  ونجنى  من  شرهم،  واغنني  بخيرك  عن  خيرهم،  وتولني  بالخصوصية  من  بينهم،  إنك  على  كل  شيء  قدير  .\n" +
                "وفارق  الشيخ  أبو  الحسن  شيخه  !!!!\n" +
                "فارقه  بجسمه  فقط  !  ولكن  توجيهه  له  لم  ينقطع  وإن  كان  ذلك  مناماً،  فيحكى  الشيخ  أبوالحسن  شيئاً  من  ذلك  فيقول:\n" +
                "  فتح  الله  في  شيء  من  الدنيا  عليّ،  فهرعت  لأستعين  وأعين  بها،  فجعلت  أحمد  الله  وأشكره،  فواظبت  على  ذلك  وقتاً  من  الليل  ونمت،  فرأيت  أستاذي  يقول  لي:\n" +
                "  استعذ  بالله  من  شر  الدنيا  إذا  أقبلت،  ومن  شرها  إذا  أدبرت،  ومن  شرها  إذا  إنقضت،  ومن  شرها  إذا  أمسكت  .\n" +
                "فجعلت  أقول  ذلك،  فواصل  الشيخ  كلامي  فقال:\n" +
                "  ومن  المصائب  والرزايا،  والأمراض  البدنية  والقلبية،  جملة  وتفصيلاً  بالكلية،  وإن  قدر  شيء  فاكسني  حلل  الرضا  والمحبة،  والتسليم،  وأثواب  المغفرة  والتوبة،  والإنابة  المرضية  .\n" +
                "بل  إنه  رضي  الله  عنه  كان  يتابعه،  ويعاتبه  إذا  سلك  مسلكاً  غير  مرضي  ومن  ذلك  قول  سيدي  أبوالحسن  الشاذلي  رضي  الله  عنه  :\n" +
                "استأذنني  بعض  الفقراء  للحضور  والسماع،  فهممت  بذلك،  فرأيت  أستاذي  رضي  الله  عنه،  وفي  يده  اليمنى  كتاب  فيه  القرآن  العظيم،  وحديث  رسول  الله  صلي  الله  عليه  وسلم،  وفي  يده  اليسرى  أوراق،  فيها  شعر  مرجز  وهو  يقول  لي  كالمنتهر:\n" +
                "  أتعدلون  عن  العلوم  الزكية،  إلى  علوم  ذى  الأهواء  الردية،  فمن  أكثر  من  هذا  فهو  عبد  مرقوق  هواه،  وأسير  لشهواته  ومناه،  يستفزون  بها  قلوب  ذوي  الغفلة  والنسيان،  وأهل  الضلالة  والعميان،  ولا  إرادة  لهم  فى  عمل  الخير  واكتساب  الغفران،  يتمايلون  عند  سماعها  تمايل  الصبيان،  لئن  لم  ينته  الظالم  ليقلبن  الله  أرضه  سماءاً  وسماءه  أرضاً!    .\n" +
                "قال:  فأخذنى  منه  حال  بوجد  وأنا  أقول  له:  نعم  يا  أستاذي،  إلا  أن  النفس  أرضية  والروح  سماوية،  فقال  لي:\n" +
                "  نعم  يا  علي،  إذا  كانت  الروح  بأمطار  العلوم  دائرة،  والنفس  بالأعمال  الصالحة  ثابتة  فقد  حصل  الخير  كله،  وإذا  كانت  النفس  غالبة  والروح  مغلوبة،  فقد  حصل  القحط  والجدب،  وانقلب  الأمر  وجاء  الشرُّ  كله،  فعليك  بكتاب  الله  الهادي،  وبكلام  رسوله  الشافي،  فلن  تزال  بخير  ما  آثرتهما،  وقد  أصاب  الشرُّ  من  عدل  عنهما،  وأهل  الحق  إذا  سمعوا  اللغو  أعرضوا  عنه،  وإذا  سمعوا  الحق  أقبلوا  عليه:\n" +
                "  \uF07D  \uF060رضي  الله  عنه\uF042\uF075صلي  الله  عليه  وسلم  \uF0F4\uF024\uF0CE\uF08Eرضي  الله  عنه\uF049\uF0F8\uF029رضي  الله  عنه\uF083  \uF05A\uF070\uF075\uF05A\uF07C\uF0A1رضي  الله  عنهم\uF06D  \uF0F7\uF08A\uF0CC\uF093\uF0AF\uF052  \uF0BC\uF0E7\uF06D\uF073\uF039  \uF024\uF070\uF06B\uF08E\uF0CF\uF0F9  \uF024•\uF05A\uF0F3\uF0A1\uF0E3\uF06D    \uF07B  [الآية23(الشورى)]  \n" +
                "ومن  أعجب  ما  روى  أبو  الحسن  الشاذلي  عن  شيخه  في  ذلك  قوله:  رأيت  كأني  جالس  مع  رجل  من  أصحابي  بين  يدي  أستاذي،  فقال:\n" +
                "  احفظ  عني  أربعة  فصول،  ثلاثة  منها  لك،  وواحدة  منها  لهذا  المسكين،  لا  تختر  من  أمرك  شيئاً،  واختر  ألا  تختار،  وفر  من  ذلك  المختار،  ومن  فرارك  من  كل  شيء  إلى  الله..  \uF07D  \uF09A\uF081\uF09A\uF02F\uF075\uF091\uF075صلي  الله  عليه  وسلم  \uF0DF\uF02C\uF0E8\uF03D\uF0F8\uF083\uF073\uF086  \uF024رضي  الله  عنه\uF042  \uF0E2\uF0E4\uF021\uF024رضي  الله  عنه\uF0B1\uF06F\uF084  \uF0E2\uF091\uF024رضي  الله  عنه\uF046\uF0F8\uF083\uF073\uF086\uF075صلي  الله  عليه  وسلم  \uF033  \uF024رضي  الله  عنه\uF042  \uF09A\uF063\uF025\uF09F\uF032  \uF0E3\uF04E\uF0DF\uF067\uF073\uF039  \uF0E4\uF06F\uF075\uF08E\uF07A\uF08D\uF0CF\uF083\uF0F8\uF03A\uF024\uF023..  \uF07B  [68القصص]\n" +
                "  وكل  مختارات  الشرع  وترتيباته،  فهى  مختار  الله،  ليس  لك  منه  شيء،  ولابد  لك  منه،  واسمع  وأطع،  وهذا  موضع  الفقه  الرباني  والعلم  الإلهامي،  وهو  أرض  لعلم  الحقيقة  المأخوذ  عن  الله  لمن  استوى،  فافهم  واقرأ:  \uF07D  \uF0E4\uF0ED\uF0F7\uF08A\uF024\uF023\uF075صلي  الله  عليه  وسلم  \uF034\uF092\uF06E\uF03C\uF0CE\uF029  رضي  الله  عنهم\uF037\uF0CE\uF06E\uF02F\uF075\uF091  \uF028  رضي  الله  عنهم\uF037•\uF052\uF0CE\uF029  \uF034\uF092\uF06E\uF03Fرضي  الله  عنهم\uF0E8\uF073\uF039  \uF094\uF057\uF089\uF0E8    \uF035\uF04F\uF08A\uF0C9\uF029رضي  الله  عنه\uF047\uF0F3\uF0A1\uF095\uF042  \uF0C7\uF0CF\uF0D0\uF0C8  \uF062\uF0CE\uF029\uF075صلي  الله  عليه  وسلم  \uF078\uF038\uF071\uF0E4\uF039رضي  الله  عنهم\uF089\uF0BBرضي  الله  عنهم\uF05F  \uF0C8\uF040\uF0E0\uF029\uF073\uF0F9  \uF0AA\uF021\uF024\uF023  \uF0E3\uF04E\uF06E\uF03D\uF0F7\uF0E6صلي  الله  عليه  وسلم\uF026  \uF024رضي  الله  عنهم\uF04A\uF0CE\uF02F  رضي  الله  عنه\uF062\uF071\uF0E8\uF03Dرضي  الله  عنهم\uF04A\uF0F7\uF0E8\uF073\uF03F  \uF0C7\uF0CF\uF0D1\uF0C8  \uF07B  [الحج].\n" +
                "وعليك  بالزهد  فى  الدنيا،  والتوكل  على  الله،  فإن  الزهد  أصل  فى  الأعمال،  والتوكل  رأس  فى  الأحوال،  واشهد  بالله،  واعتصم  به  فى  الأقوال  والأفعال  والأخلاق  والأحوال:  \uF07D  \uF060رضي  الله  عنه\uF042\uF075صلي  الله  عليه  وسلم  \uF04E\uF0C5\uF0C1رضي  الله  عنه\uF046\uF0F7\uF0E8رضي  الله  عنه\uF083  \uF0AB\uF021\uF024\uF024\uF0CE\uF02F  \uF0F4\uF089\uF073\uF029\uF073\uF0F9  رضي  الله  عنهم\uF093\uF0CF\uF089\uF0E8    \uF034\uF092\uF06E\uF03C\uF0CE\uF029  \uF03A\uF0DE\uF0BA\uF075\uF08E\uF0C5\uF0C0  \uF038\uF04C\uF0EC\uF0C9\uF029رضي  الله  عنه\uF046\uF0F3\uF0A1\uF095\uF042  \uF0C7\uF0CA\uF0C9\uF0CA\uF0C8  \uF07B  [آل  عمران].\n" +
                "وإياك  والشك  والشرك  والطمع  والاعتراض  على  الله  في  شيء.  واعبد  الله  على  القرب  الأعظم،  تحظ  بالمحبة  والاصطفائية  والتخصيص  والتولية  من  الله  \uF07D  \uF0AA\uF021\uF024\uF023\uF075صلي  الله  عليه  وسلم  \uF090\uF092\uF0CD\uF03C\uF075صلي  الله  عليه  وسلم  \uF09A\uF0FA\uF0FC\uF0C9\uF029\uF0AD\uF047\uF0DF\uF04A\uF0F8\uF039\uF024\uF023  \uF0C7\uF0CA\uF0D2\uF0C8\uF07B  [الجاثية].\n" +
                "ثم  قال:\n" +
                "  والذي  قطع  نْفس  هذا  المسكين  عن  الوصلة  بطاعته،  وحجب  قلبه  عن  شواهد  توحيده  أمران:  دخوله  فى  عمل  دنياه  بتدبيره،  وفي  عمل  أخراه  على  الريب  في  مواهب  محبوبه،  فعاقبه  الله  بالحجاب  وترادف  الارتياب  ونسيان  الحساب،  وغرق  في  بحر  التدبير  والتقدير  ودُلى  فيه  بورع  التكدير  \uF07D  \uF09F\uF078\uF073\uF0F9صلي  الله  عليه  وسلم\uF026  \uF09A\uF063\uF071\uF0E7\uF02F\uF071\uF0E7\uF047رضي  الله  عنه\uF083  \uF086\uF06E\uF03C\uF0CE\uF029  \uF0AB\uF021\uF024\uF023  \uF0BC\uF0E7\uF06Dرضي  الله  عنه\uF052صلي  الله  عليه  وسلم\uF0E3\uF08D\uF0CF\uF0FF\uF0F8\uF0F3رضي  الله  عنه\uF047\uF0F3\uF0A1\uF06F\uF084\uF075صلي  الله  عليه  وسلم  \uF034  \uF0AA\uF021\uF024\uF023\uF075صلي  الله  عليه  وسلم  \uF0D6\uF091\uF071\uF0E0\uF0FF\uF078\uF0EE  \uF0D2\uF04F\uF08B\uF0CF\uF06D\uF0A7\uF091  \uF0C7\uF0D0\uF0CD\uF0C8    \uF07B  [المائدة].\n" +
                "فارجعوا  إلى  الله  في  أوائل  التدبير  والتقدير،  تحظوا  منه  بمدد  التيسير،  ويُحال  بينكم  وبين  التعسير،  وكل  ورع  لا  يثمر  لك  العلم  والنور،  فلا  تعُدّ  له  أجراً؛  وكل  سيئة  يعقبها  الخوف  والهرب  إلى  الله  فلا  تعُدّ  لها  وزراً  .\n" +
                "ثم  قال:\n" +
                "    خذ  رزقك  من  حيث  آثر  لك  الله،  باستعمال  العلم  ومتابعة  السنة،  ولا  ترقى  قبل  أن  يرقى  بك،  فتزل  قدمك  .\n");
        text6.setTypeface(myfont);

        text7.setText("فى  شاذلة\nرسم  ابن  مشيش  حياة  أبي  الحسن  فيما  يستقبله  من  أيام  وهو  ينظر  إلى  الغيب  بنور  الله،  ولذلك  فقد  تحقق  هذا  المنهج  حرفيا  فقد  قال  له  حينما  انتهت  مدة  إقامته  عنده:\n" +
                "  يا  علي  ارتحل  إلى  أفريقية،  و  أسكن  بها  بلداً  تسمى  بشاذلة،  فإن  الله  عز  وجل  يسميك  الشاذلي،  وبعد  ذلك  تنتقل  إلى  مدينة  تونس،  ويؤتى  عليك  بها  من  قبل  السلطنة،  وبعد  ذلك  تنتقل  إلى  أرض  المشرق،  وبها  ترث  القطبانية  .\n" +
                "ولما  حان  موعد  الفراق  خاطب  أبوالحسن  شيخة  قائلاً:  يا  سيدي  أوصني،  فأوصاه  بالوصية  التى  ذكرناها  سابقاً  قال  له:\n" +
                "    يا  علي  الله  الله  والناس  الناس،  نزّه  لسانك  عن  ذكرهم،  وقلبك  عن  التمايل  من  قبلهم،    وعليك  بحفظ  الجوارح،  وأداء  الفرائض،  وقد  تمت  ولاية  الله  عندك،  ولا  تذكرهم  إلا  بواجب  حق  الله  عليك،  وقد  تم  ورعك،  وقل  اللهم  أرحنى  من  ذكرهم،  ومن  العوارض  من  قبلهم،  ونجنى  من  شرهم،  وأغنني  بخيرك  عن  خيرهم،  وتولني  بالخصوصية  من  بينهم،  إنك  على  كل  شيء  قدير  .\n" +
                "وودع  أبو  الحسن  شيخه،  وسار  وقد  وضح  أمامه  الطريق  واتجه  –  تنفيذاً  لأمر  أستاذه  –  نحو  تونس.\n" +
                "ولما  وصلها  وعند  دخوله  إليها  تقابل  مع  رجل  حطاب  فقير  هو  أبوالحسن  على  الأبرقى  من  أهل  شاذلة  وهي  قرية  قريبة  من  مدينة  تونس،  فصحبه  معه  وخرج  الرجلان  واتجها  نحو  شاذلة.\n" +
                "وفى  الطريق  رأى  الأبرقى  علامات  كثيرة  من  زهد  الشاذلي  وصلاحه  يقول  فى  ذلك  صاحب  (درة  الأسرار):\n" +
                "  ولما  توجه  رحمه  الله  من  عند  أستاذه  إلى  أفريقيا  وأمره  بالنقلة  إلى  شاذلة  وصل  إلى  مدينة  تونس  إلى  مصلى  العيدين،  فلقى  بها  حطاباً  من  أهل  شاذلة،  فخرج  معه  متوجهاً  إليها  على  نحو  ما  أمر  به  الأستاذ  فنسى  الحطاب  حاجة  فى  السوق  فرجع  قاصداً  إليها  وترك  الحمار  عنده،  فلما  توجه  قال  فى  نفسه:  هذا  رجل  غريب  يهرب  لى  بالحمار  وأبقى  فى  عدمه؟،  فناداه  الشيخ  فرجع  إليه  فقال  له:  يا  بني  خذ  حمارك  معك!  وأنتظرك  حتى  تعود  إلىّ  لئلا  أهرب  لك  بالحمار  على  زعمك  وتبقى  فى  طلبه  !!  ..  فبكى  الحطاب  وقال:  والله  ما  اطّلع  على  هذا  إلا  الله  تعالى!\n" +
                "فعلم  بولايته  فجعل  يقبل  يديه  ويسأله  الدعاء  .\n" +
                "وتقول  الرواية  إن  بركات  الشاذلي  حلت  برفيقه  فأقبلت  عليه  الدنيا  ووسّع  عليه  فى  الرزق  بعد  ذلك.\n" +
                "ونزل  أبوالحسن  بطرف  من  أطراف  شاذلة،  وقابل  فيها  أول  من  قابل  الشيخ  الصالح  أبا  محمد  عبدالله  بن  سلامة  الحبيبي،  وقد  فرح  الحبيبي  بلقاء  أبى  الحسن  فقد  كان  يترقب  هذا  اللقاء  منذ  مدة  ..  واسمعوا  للحبيبى  ....  قال:\n" +
                "  كنت  أحضر  بتونس  مجلس  سيدنا  الشيخ  العارف  أبى  حفص  الجاسوس،  فأخذت  بيده  يوماً  أطلب  منه  أن  يقبلنى  تلميذا  له،  وقلت  له:  يا  سيدي  إني  اتخذتك  شيخي،  فقال  لي:  يا  بني  ارتقب  أستاذك  حتى  يصل  من  المغرب  وهو  شريف  حسنى  من  كبار  الأولياء،  وهو  أستاذك  وإليه  تنتسب  .\n" +
                "  فكنت  أرتقب  كل  من  يأتى  من  الفقراء  المغاربة  وأصحبه،  إلى  أن  منّ  الله  عليّ  بلقاء  الشيخ  أبى  الحسن  فاتخذته  شيخي  وصحبته  .\n" +
                "وفي  شاذلة  تأسى  الشاذلي  بأستاذه  ابن  مشيش،  فلم  يسكن  فى  القرية  وإنما  لجأ  إلى  غار  فى  جبل  زغوان  المطل  على  شاذلة،  واتخذ  هذا  الغار  رباطاً  له،  يقيم  ويتعبد  فيه.\n" +
                "وكانت  حياة  الشاذلي  فى  هذا  الغار  كلها  تقشفاً  وزهداً  وإغراقاً  فى  العبادة،  وكان  يشاركه  فى  هذه  الحياة  فى  معظم  الأوقات  تلميذه  الحبيبي،  وهو  الذي  روى  من  كرامات  الشيخ  فى  هذه  الفترة  الشيء  الكثير.\n" +
                "يقول  صاحب  كتاب  (درة  الأسرار):  فمما  حكى  عنه  قال:\n" +
                "    قرأ  الشيخ  يوماً  على  جبل  زغوان  سورة  الأنعام  إلى  أن  بلغ  قوله  الله  \uF07D  \uF062\uF0CE\uF029\uF075صلي  الله  عليه  وسلم  \uF0F6\uF041\uF0CF\uF089\uF0F7\uF0E8\uF073\uF03F  •\uF040\uF0E0\uF032  \uF035\uF041\uF0F4\uF089رضي  الله  عنه\uF0E3  \uF09E\uF077  \uF0F5\uF08B\uF073\uF07B\uF0F7\uF073\uF0E3\uF083  \uF021\uF024\uF070\uF06B\uF0F7\uF05D\uF0CF\uF042    \uF07B  [70الأنعام]،  أصابه  حال  عظيم،  وجعل  يكررها  ويتحرك،  فكلما  مال  إلى  جهة  مال  الجبل  نحوها  حتى  سكن  الجبل  .\n" +
                "وما  كانت  حياتهما  على  الجبل  إلا  على  نباتات  الأرض  وأعشابها  حتى  أنه  لكثيرا  ما  كانت  أشداق  أبى  محمد  الحبيبي  تتقرح  فيشفق  عليه  أبو  الحسن  وينزل  معه  إلى  شاذلة  ليجد  الغذاء  الذي  لا  يضر  به.\n" +
                "وعن  سر  هذه  الفترة  التى  قضاها  الشيخ  فى  شاذلة  يقول  الدكتور  عبدالحليم  محمود  فى  كتابه  (أبو  الحسن  الشاذلي)  صفحة  26:\n" +
                "  أما  الفترة  التى  قضاها  بشاذلة،  فإنها  فيما  يبدو،  فترة  صقل  لا  بد  منه،  إنها  فترة  عبادة  ونسك  على  الخصوص،  وذلك  أساس  ضرورى  لكل  من  أراد  البناء  الخالد  ،  وما  من  شك  فى  أن  أبا  الحسن،  وقد  هيأ  الله  له  سبيل  الهداية  عابداً  أو  مهاجراً  وسائحا  فى  سبيل  الله،  كان  منار  هداية  ومبعث  نور  أينما  حل،  خصوصاً  بعد  أن  هداه  الله  إلى  ابن  مشيش  ...\n" +
                "ولقد  كان  الشيخ  نفسه  يشعر  بحاجته  إلى  المجاهدة،  وذلك  شيمة  كل  مخلص،  إن  المخلصين  وإمامهم  رسول  الله  صلوات  الله  وسلامه  عليه،  يشعرون،  مهما  بلغوا،  أنهم  فى  حاجة  إلى  مزيد  من  فضل  الله  \uF07D  \uF040\uF0E8\uF025\uF075صلي  الله  عليه  وسلم  \uF0C9\uF062\uF03E\uF0A7\uF091  \uF092\uF0CE\uF054\uF0F7\uF08A\uF0CE\uF097  \uF024\uF056\uF04A\uF0F9\uF03D\uF0CF\uF0E3  \uF0C7\uF0CA\uF0CA\uF0CD\uF0C8  \uF07B  [طه].\n" +
                "وطريق  زيادة  العلم  بالنسبة  لأولياء  الله،  إنما  هو  الجهاد  فى  الله،  ولله  مع  ذلك  منح  ومواهب  لا  تتعلق  بسبب  ولا  تترتب  على  علل    \n" +
                "  ثم  يستطرد  الدكتور  عبدالحليم  محمود  ليبين  فوائد  الرحلة  إلى  جبل  زغوان  وذلك  فى  نفس  المرجع  صفحة  27  فيقول:\n" +
                "  أما  رحلة  أبى  الحسن  إلى  جبل  زغوان  فإن  لها  فائدتين:  ..  الأولى  هى  تفرغه  هو  للعبادة:\n" +
                "ولا  بدمن  هذا  التفرغ  ما  دام  الإنسان  لم  يأته  الإذن  بعد  بالدعوة.\n" +
                "لا  بد  من  التفرغ  لاستكمال  نقص،  أو  للبعد  عن  الفتنة،  أو  للتغلب  على  آثار  هوى،  ولا  بد  من  هذا  التفرغ  استجماما  روحياً،  وعلاجاً  نفسياً،  وبعثا  لكوامن  الفضائل،  ولا  بد  من  هذا  التفرغ  ليرقى  فى  مدارج  السالكين،  وليحقق  العروج  فى  معارج  القدس،  وليسير  الخطى  متدرجاً  فى  منازل  الأرواح،  ولا  بد  من  هذا  التفرغ  فراراً  إلى  الله\n" +
                "\uF07D  \uF028\uF023\uF0FFصلي  الله  عليه  وسلم\uF094\uF08D\uF0CF\uF0FF\uF073\uF0F9  \uF092\uF06E\uF03C\uF0CE\uF029  \uF0AB\uF021\uF024\uF023  \uF028  \uF07B  [50الذاريات]  و  \uF07D  \uF0E0\uF04D\uF0F9\uF03D\uF0C9  رضي  الله  عنه\uF0E3\uF075صلي  الله  عليه  وسلم  رضي  الله  عنهم\uF037\uF0F8\uF08B\uF073\uF039\uF0CE\uF029  \uF0C9\uF062\uF03E\uF075\uF091  \uF034\uF0D3رضي  الله  عنهم\uF0CC\uF0F7\uF08Eرضي  الله  عنه\uF049\uF0CF\uF039  \uF0C7\uF0D1\uF0CD\uF0C8  \uF07B  [طه].\n" +
                "أما  الفائدة  الثانية  من  الذهاب  إلى  جبل  زغوان:\n" +
                "فإنها  لمنع  اللاهين  المتطفلين  من  الجلوس  على  مائدة  الشيخ  الروحية:  ذلك  أنه  سوف  لا  يذهب  إلى  جبل  زغوان  لرؤية  الشيخ  إلا  محبٌّ  للمعرفة  جادٌ  فى  طلبها.\n" +
                "وما  كان  الشيخ  على  الجبل  محجوباً  عمن  يريد  لقاءه،  كلا،  ولكنه  بذلك  أتاح  لنفسه  الفرصة  للتعبد  وللمجاهدة،    وإن  حياة  جهاد  فى  الله  كهذه،  لا  بد  لها  من  ثمارها  من  الكرامات  ...،  ومن  شفافية  النفس  ...،  ومن  القرب  من  الله  ومن  رضوانه  سبحانه.\n");
        text7.setTypeface(myfont);
    }
}
