package com.example.ahmedyehia.myapplication;

import android.graphics.Typeface;
import android.support.v7.app.AppCompatActivity;
import android.os.Bundle;
import android.widget.TextView;

public class Firstbook4 extends AppCompatActivity {

    TextView text1  ;
    Typeface myfont;

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_firstbook4);
        myfont = Typeface.createFromAsset(this.getAssets(), "fonts/me_quran_volt_newmet.ttf");
        text1 = (TextView) findViewById(R.id.text1);


        text1.setText("منهجه رضي الله عنه فى السلوك إلى الله\n إخوانى الكرام ... لكى نتبصر فى منهج الشيخ أبى الحسن الشاذلى رضي الله عنه فى سلوكه إلى الله فى هذا الفصل ... ثم نستبين الأسس التى بنى عليها دعوته وذلك فى الفصل التالى من هذا الباب ... سأعيد عليكم وباختصار قراءة تاريخ الشيخ الذى بيناه فى الباب السابق .. وذلك لكى نستلهم العبرة ونستوضح الحكمة ونتوقف عند محطات منهاجه السلوكى .. ونستروح الإشارات من هذه السيرة العطرة .. .\n" +
                "ونبدأ ... فنقول أن نشأته رضي الله عنه كانت كما ذكرنا كنشأة كل الكمل من الصالحين .. حفظ القرآن وجوَّده وهو ابن ست، ثم حصّل ما استطاع تحصيله فى بلده من الحديث، وتاقت نفسه إلى العلم ودائما ما تجد فى نفوس الصالحين الأكابر توقاً إلى العلم وذلك لأن عبادة الأنبياء والمرسلين والكمّل من الصالحين هى العلم: \uF07D \uF040\uF0E8\uF025\uF075صلي الله عليه وسلم \uF0C9\uF062\uF03E\uF0A7\uF091 \uF092\uF0CE\uF054\uF0F7\uF08A\uF0CE\uF097 \uF024\uF056\uF04A\uF0F9\uF03D\uF0CF\uF0E3 \uF0C7\uF0CA\uF0CA\uF0CD\uF0C8 \uF07B [طه].\n" +
                "هذه هي عبادتهم ولكنه العلم الذي يقرب إلى الله ويختصر الطريق الموصل إلى رضوان الله والكاشف لحقائق كتاب الله والمبين لأسرار وألفاظ حديث رسول الله والأخذ بأيدي السالكين ليوصلهم إلى حضرة الله جل فى علاه – هذا علمهم ...\n" +
                "ولما كان الحاكم الذي يحكم بلاد المغرب الأقصى فى هذا الوقت ضيق الأفق وقد شن حملة كبيرة على العلماء فمنهم من سجنه ومنهم من قتله، اتجه الشاذلى إلى تونس التى اتجه كل العلماء إليها من بلاد المغرب لما فيها من رحابة صدر ووسعة للعلم وأهله واستقر فيها وتنقل بين ربوع بلدانها ومدنها وتلقى الفقه على مذهب الإمام مالك ودرس ما يلزم من علوم الدين واللغة أفاض فى ذلك وتبحر! ولم ينتقل إلى علوم القوم حتى تصدر فى علوم الظاهر كلها وأصبح يشار إليه بالبنان فيها !! ...\n" +
                "ومن هنا يكون أول بيان لمنهج المدرسة الشاذلية فى السلوك... فيبين الشيخ ابن عطاء الله السكندرى رضي الله عنه هذا المنهج المبارك فيقول:\n" +
                "\"كان شيخى أبو العباس وشيخه أبا الحسن رضى الله عنهما لا يأخذون العهد على مريد لسلوك الطريق إلا بعد أن يتأكدا من إحاطته وعلمه التام بالشريعة المطهرة – إذ لا بد وأن يتبحر أولا فى علوم الشريعة بعدها يلقنونه العهد ويأخذا بيديه ليدلوه على علوم الحقيقة وذلك لأن كل حقيقة بغير شريعة باطلة وكل شريعة بغير حقيقة عاطلة \"\n" +
                "لا بد من الشريعة والحقيقة ولذلك دائما ما أقول لأخوانى:\n" +
                "لابد أولا من الإلمام بالشريعة لكننا نحيطها بسياج وهو ألا نلم بالشريعة للجدل أو للمناظرة ولكن نلم بالقدر الذي نحتاجه للعمل الذي يرضى الله جل فى علاه فيتعلم السالك مثلاً من باب الطهارة والوضوء والصلاة ما به يحسن الصلاة وينال بها القبول عند مولاه وهكذا، أما الجدال وآراء المذاهب فإنه شان المختصين فى هذا المجال وليس لدينا وقت لنشغل البال بمثل ذلك.\n" +
                "وبعد أن انتهى رضي الله عنه من الإحاطة بالقدر الواجب من العلوم الشرعية واللغوية والدينية وكان اثناء ذلك يتقدم لمن يعرفه من الصالحين ليتعرف عليه ويأخذ ما عنده ..فلم تم لها ما أراد ببلاده، عزم على استكمال الهجرة إلى بلاد المشرق مصر والجزيرة العربية والشام والعراق، لماذا؟\n" +
                "أولاً: ليستكمل نهمه فى طلب العلم، لأن العلم فى ذاك الوقت كان أعلى وأرقى في بلاد المشرق، ثانياً: ليحج بيت الله عزوجل الحرام ويزور المصطفى عليه أفضل الصلاة وأتم السلام، ثالثاً: يتعرف على الصالحين والأولياء والمتقين الذين كان يبحث عنهم ليشفى غليله ويروى ظمأه إلى المعرفة اليقينيه ولا تكون إلا بالتعرف على هذه الفئة التى اختصها الله بالنورانية والشفافية والعلوم الإلهية الإلهامية.\n" +
                "ومشى حتى أدى فريضة الحج ثم ذهب إلى بلاد الشام وتجول فى ربوعها وحصّل من علماءها وشيوخها وصالحيها ثم ذهب إلى بلاد العراق! كل ذلك وعمره فى ذاك الوقت سنتان وعشرون عاما!!!\n" +
                "وهنا وقفة عند محطة الهمة فى السلوك  وهى المحطة التى تجعل من العبيد ملوك !!!!! انظروا إلى همة الرجال .... و بغير الهمة لا يصل الإنسان السالك إلى بغيته إذ لا بد للسالك من همة لا تكل .. وعزيمة لا تُفَل!\n" +
                "وبعد أن جال فى بلاد العراق ... وكانت فى أوج الإزدهار فى ذلك الوقت من الناحية العلمية والناحية الروحية والحضارة والمدنية، بعدها أشاد بالرجل الذي لقيه فى العراق ولم يلق له مثيلاً فى طريق الله عزوجل وهو كما ذكرنا الشيخ أبوالفتح الواسطى، أحد تلاميذ الإمام أحمد الرفاعى رضي الله عنه.\n" +
                "والشاذلى كانت له همّة علية لأنه لم يكن يبحث عن أي ولي ويسلم له القياد بل كانت روحه تهفو إلى القطب ... قطب الأولياء .. وهو رئيسهم وكبيرهم الذي يصل إليه المدد من حضرة النبي المختار ويوزع منه المدد على سائر الأولياء والصالحين فى كل الأقطار!!\n" +
                "فسأل الشيخ أباالفتح الواسطى وقال: أريد القطب، وانظر إلى الكشف الصادق والأدب الراقى قال له: جئت تبحث عن القطب عندنا مع أنه عندك فى بلاد المغرب، قال: أين؟ قال فى موطن ميلادك وهو الشيخ عبدالسلام بن بشيش.\n" +
                "وكان أبوالفتح الواسطى يعرف القطب بالشفافية النورانية، ولا يريد أن يستأثر بالمريدين لأنهم يعلمون علم اليقين أنهم جميعاً فى دائرة سيد الأولين والآخرين وكلٌ يربى ما كلف به من حضرته صلي الله عليه وسلم.\n" +
                "فرجع الشاذلى على قدميه رحلة طويلة شاقة للبحث عن القطب وذلك لكي يعلم الناس الذين أكرمهم الله بمعرفة القطب بدون تعب ومشقة مقدار فضل الله عليهم ومبلغ نعم الله عزوجل العظمى عليهم وإن كان من طبيعة الإنسان فى أى زمان ومكان لا يعرف قيمة النعمة إلا إذا فقدها!\n" +
                "ويقول الإمام أبو العباس المرسى :رضي الله عنه\n" +
                "\"يكون الولى بينهم ولا يعرفونه فإذا مات دخل فى طريقته أضعاف أضعاف من دخلها فى حياته\" \n" +
                "وهذه طبيعة الناس وهى الزهد فى المتاح، مثلاً نحن نزهد فى الشمس والماء لأنهما موجدان بوفرة فى بلادنا ويأتى الناس من أقصى بلاد العالم من أجل لحظات فى شمسنا الساطعة أو ليشربون شربة من مياهنا العذبة الرائعة!\n" +
                "فرجع الشيخ أبوالحسن رضي الله عنه إلى الجبل المقيم فيه شيخه – قال: وصلت ليلاً وصعدت أعلى الجبل فسمعت صوته بداخله فكرهت أن أشوش عليه خلوته.\n" +
                "وهنا محطة أدب يقف عندها المريدون الطالبون!!! قال: فبت خارج الخلوة حتى الصباح لكى لا أشوش عليه خلوته، وأنا أقول لكم يا إخوانى: \n" +
                "\"من رزق الأدب وصل إلى أعلى الرتب ومن حُرم الأدب أصيب بالعطب\" والطريق كله أدب.\n" +
                "كيف وصل الحبيب المختار إلى أعلى درجات الإختصاص عند العزيز الغفار؟ كاشفه الله بكل ما فى ملكوته وعوالم غيبه فلم يلتفت إليها انشغالاً بحبيبه حتى قال الله عزوجل لنا فى شأنه: \uF07D \uF024رضي الله عنه\uF042 \uF073\uF0F8\uF023\uF079\uF097 \uF0E7\uF08E\uF07C\uF0C7رضي الله عنه\uF037\uF0F8\uF039\uF024\uF023 \uF024رضي الله عنه\uF042\uF075صلي الله عليه وسلم \uF034\uF0D3\uF078\uF0F6\uF073\uF0DB \uF0C7\uF0CA\uF0D0\uF0C8  \uF07B [النجم]، لم يزغ بصره هنا أو هناك !!! ولذلك فإن المريد الذي يزوغ بصره مع الدنيا أو الذي يتوه فى سعيه لجمع حطامها !! أو الذي ينشغل ببهرجها وزخرفها وزيناتها !!! ماذا يرجو بعد ذلك من الأحوال العلي و العطاءات الربانية؟! تلكم المسالك تحتاج إلى همة علية تجعل البال لا ينشغل إلا بالذات العلية فى كل أحواله وفى كل أنفاسه وفى كل حركاته وسكناته !\n" +
                "علم الشاذلى أن شيخه فى خلوته .. وقد وصل عنده بالليل .. فلم يزعجه .. ولم يدق عليه الباب .. بل آثر أن ينام خارج الخلوة !!\n" +
                "ولعلكم لا تعلمون الشدة التى يعانيها من يبيت فى العراء على أعلى جبل قريب من مضيق جبل طارق !! فهى جبال تتنزل عليها الثلوج لكنه آثر ذلك على أن يدخل على شيخه فى وقت الليل .. وهو أدب الصالحين.\n" +
                "فلما أصبح دخل عليه .. وانظر إلى فراسة الصالحين؟!! قال:\n" +
                "مرحباً بك يا علي يا ابن عبدالله .. وذكر نسبه إلى رسول الله صلي الله عليه وسلم .\n" +
                "ثم قال له: إنزل فاغتسل ثم اصعد إلينا؟ وكان أسفل الجبل عين ماء فنزل واغتسل بظاهره ثم صعد، قال له ثانية: انزل فاغتسل ثم ارجع إلينا؟ فلما كررها ثلاث قال علمت أنه يريد أن أغتسل من علمى الذي حصَّلته! فغسلت نفسي من علومى ومعارفى ثم صعدت إليه فقيراً فقال: يا علي جئت إلينا فقيراً من علمك وعملك فجئنا لك بغنى الدنيا والآخرة.\n" +
                "وهنا مححة أخرى عظيمة من محطات السلوك إلى الله ...:\n" +
                "شرط المقبل الذي يريد الفتح أن يقبل على شيخه فقيراً: \uF07D \uF0C9\uF062\uF03E\uF075\uF091 \uF092\uF0CE\uF06F\uF054\uF0CE\uF029 \uF021\uF024\uF079\uF04A\uF0CF\uF039 \uF07C\uF04D\uF0F8\uF039رضي الله عنه\uF093\uF052صلي الله عليه وسلم\uF026 \uF0A5\uF092\uF06E\uF03C\uF0CE\uF029 \uF0F4\uF060\uF0CF\uF042 \uF039\uF08E\uF0F6\uF08D\uF079\uF07A \uF0D7\uF08E\uF08D\uF0C9\uF029\uF073\uF0F9 \uF0C7\uF0CB\uF0CD\uF0C8 \uF07B [القصص]، وذلك لأن كل علوم الكتب والمكتبات لا تساوى بعض ذرة من علوم الإلهامات !! فمن يقرأ ويظن بذلك أنه قد علم فإنه يغتر بعلمه .. ثم يدفن نفسه فى هذا الغرور ..، ولن يكشف له وينبلج هذا النور ... إلا إذا عولج من هذا المرض اللعين وهو مرض الغرور ...!!!!\n" +
                "ومكث الشاذلى مع شيخه يتلقى منه بعد فنائه عن علمه وعمله وكله حتى قال رضي الله عنه: \"ومكثت عنده حتى كشف الله عن بصيرتي ورأيت منه كرامات كثيرة\" .\n" +
                "وبعد أن انتهت المرحلة قال: يا علي انتقل إلى تونس واسكن فى بلد فيها تسمى شاذلة – وستسمى فيها بالشاذلى ثم تنزل إلى تونس للدعوة إلى الله ويؤتى عليك فيها من قِبَل السلطان ثم تُنقل إلى المشرق وبه ترث مقام القطبانية ... وهنا محطة أخرى عظيمة من محطات السلوك ....\n" +
                "هو رضي الله عنه بذلك لم يترك شيخه إلا بعد انفتاح البصيرة!!! وبعد إنفتاح البصيرة أيضاً لم يكتفِ بذلك ... وهنا إشارات لكل سالك فليعتبر!!\n" +
                "بل إن شيخه لم يربي إلا هذا الرجل ولذلك قال الشاذلى رضي الله عنه ... والخطاب هنا لأهل التربية ...:\n" +
                "\"ليس الشأن أن تربي ألف رجل لا تستطيع أن تستودع واحداً منهم سرك لكن الشأن أن تربي رجلاً واحداً تستودعه سرك\".\n" +
                "فالولاية سر ينتقل من صاحب سر إلى محل قابل للسر، فإذا كان معك ألف مريد وليس فيهم محلاً قابلاً للسر فإنك ستموت دون أن تستودع هذا السر !!!!\n" +
                "ومع أن أبا الحسن كان واحداً مفرداً مع شيخه إلا أنه أصبح قطب الأقطاب !!! وانظروا ماذا فعلت طريقته !!! وما عدد أحبابه !!! وما مقدارهم !!! وكم عدد الرجال الذين رباهم؟\n" +
                "ذلك كله لأنه حمل السر!!! لا.. وهنا عظة وعبرة لكل سالك ! من يحمل السر ومن يكون أهلا لكتم الأسرار؟؟؟؟\n" +
                "ثم عاد الشاذلى مرة أخرى إلى تونس وهى المرة الثانية بعد التصفية والتخلية للتجمل بالعطاءات الإلهية ولوائح الأنوار الربانية واكتمال المواصفات الكمالية على القدم المحمدية.\n" +
                "وأنبه على إخوانى أيضاً أن نُزيل ما نُسب إلى الصالحين من كرامات قالها أو تناقلها المحبون والمريدون وظنوا أنها تزيد فى مكانة شيخهم بينما المشايخ الصادقون لا يحتاجون إلى إضافات إلى سيرهم الصحيحة.\n" +
                "ولذلك فإن مبدأنا فى الكرامات: \"كل ما لا يقبله العقل فاعلم أنه لا يصح فى النقل\" ، وكان الشاذلى رضي الله عنه عندما سألوه عن الكرامات قال:\n" +
                "\"إن أكبر الكرامات هى الإستقامة\".\n" +
                "فالاستقامة خير من ألف كرامة، وإذا رزقك الله الاستقامة وحفظك من المعاصى والفتن ما ظهر منها وما بطن ووفقك لطاعته وجعلك أهلاً لعلوم عنايته فماذا تريد بعد ذلك فى ولايته؟\n" +
                "لأن من يقرأ كتب الطبقات التى تتعرض للمشايخ وخاصة سيدي أبى الحسن الشاذلى يجد الكثير من هذه الكرامات المنسوبة إليهم !!! ولسنا فى حاجة إلى ذكرها ... ولكننا نركز على عناية الله بهم ... ورأفة الله تعالى بهم وأدبهم مع المشايخ ومع الصالحين ... وكيف أن الله عزوجل جعلهم مكرمين فى كل وقت وحين ........\n");
        text1.setTypeface(myfont);

    }

}