package com.example.ahmedyehia.myapplication;

import android.graphics.Typeface;
import android.support.v7.app.AppCompatActivity;
import android.os.Bundle;
import android.widget.TextView;

public class Firstbook8 extends AppCompatActivity {

    TextView text1 ;
    Typeface myfont;

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_firstbook8);
        text1= (TextView)findViewById(R.id.text1);
        myfont = Typeface.createFromAsset(this.getAssets(), "fonts/me_quran_volt_newmet.ttf");


        text1.setText("من وصاياه رضى الله عنه\n قال الكمال الدميري فى الكتاب الشهير حياة الحيوان قال الشـيخ أبو الحسن الشاذلي رحمه الله تعالى:\n" +
                "كن متمسكاً بهذه الصفات الحميدة تفز بسعادة الدارين: لا تتخذ من الكافرين ولياً، ولا من المؤمنين عدواً، وارتحل بزادك من التقوى فى الدنيا، وعد نفسك من الموتى، واشهد لله بالوحدانية ولرسوله بالرسالة وقل سمعنا وأطعنا وحسبك عمل صالح وإن قل، وقل: آمنت بالله وملائكته وكتبه ورسله، وقل سمعنا وأطعنا غفرانك ربنا وإليك المصير.\n" +
                "فمن كان متمسكاً بهذه الصفات الحميدة ضمن الله عزوجلله:\n" +
                "-\tأربعة فى الدنيا:الصدق فى القول، والإخلاص فى العمل، و الرزق كالمطر، والوقاية من الشر.\n" +
                "-\tوأربعة فى الآخرة: المغفرة العظمى،والقربة الزلفى، ودخول الجنة، اللحوق بالدرجة العليا.\n" +
                "وقال: إن أردت الصدق فى القول فداوم على قراءة\n" +
                "\uF07D \uF021\uF024\uF0AF\uF052\uF0CE\uF029 \uF0E7\uF06D\uF0BB\uF06F\uF059\uF0F8\uF039رضي الله عنه\uF093\uF052صلي الله عليه وسلم\uF026 \uF092\uF0CE\uF0FB \uF0CF\uF027\uF073\uF023\uF0F8\uF08B\uF073\uF039 \uF0CD\uF091\uF0F4\uF089\uF073\uF029\uF0F8\uF039\uF024\uF023  \uF07B [سورة القدر]،.\n" +
                "-\t وإن أردت الرزق كالمطر: فداوم على قراءة: \uF07D  \uF0F6\uF040\uF0E8\uF025 \uF0E8\uF08C\uF071\uF0E3\uF0E3صلي الله عليه وسلم\uF026 \uF0C9\uF062\uF03Eرضي الله عنه\uF08D\uF0CE\uF02F \uF0C8\uF02C\uF06E\uF03D\uF078\uF0FF\uF0F8\uF039\uF024\uF023  \uF07B، وإن أردت السلامة من شر الناس: فداوم على قراءة: \uF07D \uF0F6\uF040\uF0E8\uF025 \uF0E8\uF08C\uF071\uF0E3\uF0E3صلي الله عليه وسلم\uF026 \uF0C9\uF062\uF03Eرضي الله عنه\uF08D\uF0CE\uF02F \uF0C4•\uF024•\uF059\uF039\uF024\uF023 \uF07B.\n" +
                "-\tوإن أردت جلب الخير والرزق والبركة: فداوم على قراءة: \"بسم الله الرحمن الرحيم الملك الحق المبين هو نعم المولى ونعم النصير\" وقراءة سورة الواقعة، وسورة يس، فإنه يأتيك الرزق كالمطر.\n" +
                "-\tوإن أردت أن يجعل الله لك من كل هم فرجا ومن كل ضيق مخرجا ويرزقك من حيث لا تحتسب:\n" +
                " فالزم \"الاستغفار\".\n" +
                "-\tوإن أردت أن تأمن مما يروعك ويفزعك فقل: \"أعوذ بكلمات الله التامات من غضبه وعقابه ومن شر عباده ومن همزات الشياطين وأعوذ بك ربى أن يحضرون\".\n" +
                "-\tوإن أردت أن تعرف أى وقت تفتح فيه أبواب السماء ويستجاب الدعاء:.... فاشهد وقت نداء المنادى فأجبه ففى الحديث: { من نزل به كرب أو شدة فليجب المنادى }   \"والمنادى هو المؤذن\".\n" +
                "وقال: وإن أردت أن تسلم من أمر يكربك فقل: \"توكلت على الحى الذي لا يموت أبداً والحمد لله الذي لم يتخذ ولدا ولم يكن له شريك فى الملك ولم يكن له ولي من الذل وكبره وتكبيرا\" ففى الحديث: { مَا كَرَبَنِي أَمْرٌ إِلاَّ تَمَثَّلَ لِي جِبْرِيلُ فَقَالَ: يَا مُحَمَّدُ قِلْ: تَوَكَّلْتُ عَلَى الْحَي الَّذِي لاَ يَمُوتُ، وَالْحَمْدُ لِلَّهِ الَّذِي لَمْ يَتَّخِذْ وَلَداً وَلَمْ يَكُنْ لَهُ شَرِيكٌ فِي الْمُلْكِ وَلْم يَكُنْ لَهُ وَلِيٌّ مِنَ الذُّل وَكَبرْهُ تَكْبِيراً }.\n" +
                "وقال: إن أردت أن تنجو من هم أو غم أو خوف يصيبك فقل: \"اللهم إنى عبدك وابن عبدك ابن أمتك، ناصيتي بيدك ماضٍ فيَّ حكمك، عدل فيّ قضاؤك، أسألك بكل اسم هو لك سميت به نفسك أو أنزلته فى كتابك أو علمته أحداً من خلقك أو استأثرت به فى علم الغيب عندك أن تجعل القرآن العظيم ربيع قلبي ونور صدري وجلاء حزني وذهاب همي وغمي\" فيذهب عنك همك وغمك وحزنك.\n" +
                "وقال: وإن أردت أن يداويك الله من تسعة وتسعين داء أيسرها اللمم فقل ما ورد فى الحديث: \"لا حول ولا قوة إلا بالله العلي العظيم\" فإنها دواء مما ذكر.\n" +
                "وقال: إن أردت أن تؤجر من مصيبة فقل: \" إنا لله وإنا إليه راجعون، اللهم عندك احتسبت مصيبتي فأجرني فيها وأبدلني خيراً منها ومنه حسبنا الله ونعم الوكيل، وتوكلنا على الله وعلى الله توكلنا\"\n" +
                "وقال: وإن أردت أن يذهب همك ويقضي دينك فقل إذا أصبحت وإذا أمسيت: \"اللهم إني أعوذ بك من الهم والحزن، وأعوذ بك من العجز والكسل، وأعوذ بك من الجبن والبخل، وأعوذ بك من غلبة الدين وقهر الرجال\"..\n" +
                "وقال: \n" +
                "-\tوإن أردت أن توفق للخشوع: فاترك فضول النظر.\n" +
                "-\tوإذا أردت أن توفق للحكمة: فاترك فضول الكلام.\n" +
                "-\t وإن أردت أن توفق لحلاوة العبادة: فاترك فضول الطعام وعليك بالصوم وقيام الليل والتهجد فيه.\n" +
                "-\tوإذا أردت أن توفق للهيبة: فاترك المزاح والضحك فإنهما يسقطان الهيبة.\n" +
                "-\tوإن أردت أن توفق للمحبة فاترك فضول الرغبة فى الدنيا، وإن أردت أن توفق لإصلاح عيب نفسك: فاترك التجسس على عيوب الناس فإن التجسس من شعب النفاق كما أن حسن الظن من شعب الإيمان.\n" +
                "-\tوإذا أردت أن توفق للخشية: فاترك التوهم فى كيفيات ذات الله تعالى تسلم من الشك والنفاق.\n" +
                "وقال رضى الله عنه وأرضاه أيضاً فيما ورد عنه:\n" +
                "-\tوإن أردت السلامة من كل سوء:....  فاترك الظن السيء بكل الناس.\n" +
                "-\tوإن أردت العزلة:.... فاترك الإعتماد على الناس ... وتوكل على الله.\n" +
                "-\tوإن أردت ألا يموت قلبك:..... فقل كل يوم أربعين مرة: \"يا حي يا قيوم لا إله إلا أنت\".\n" +
                "-\tوإن أردت أن ترى النبي يوم القيامة يوم الحسرة والندامة: ..... فأكثر من قراءة:\uF07D \uF023\uF073\uF08C\uF0CE\uF029 \uF0DF\uF0A7\uF0F7\uF04B\uF0A4\uF0B1\uF039\uF024\uF023 \uF0F4\uF04E\uF075\uF091\uF0C8\uF068\uF071\uF0E4\uF02E \uF07B و\n" +
                " \uF07D \uF023\uF073\uF08C\uF0CE\uF029 \uF0E2\uF0E4\uF021\uF024\uF079\uF04A\uF0A1\uF0A1\uF039\uF024\uF023 \uF0F4\uF04Eرضي الله عنه\uF08D\uF073\uF0DC\uF078\uF0FF\uF052\uF024\uF023  \uF07B و \uF07D  \uF023\uF073\uF08C\uF0CE\uF029 \uF0E2\uF0E4\uF021\uF024\uF075\uF04B\uF0A1\uF0A1\uF039\uF024\uF023 \uF0F4\uF04D\uF0A4\uF029رضي الله عنه\uF0B1\uF053\uF024\uF023  \uF07B \n" +
                "-\tوإن أردت أن ينور وجهك: .....فداوم على قيام الليل.\n" +
                "-\tوإن أردت السلامة من عطش يوم القيامة:... فلازم الصوم.\n" +
                "-\tوإن أردت أن تسلم من عذاب القبر:.... فاحترز من النجاسات ....واترك أكل المحرمات ...وأرفض الشهوات.\n" +
                "-\tوإن أردت أن تكون غنيا: ....فلازم القناعة.\n" +
                "-\tوإن أردت أن تكون خير الناس: ....فكن نافعاً للناس.\n" +
                "-\t وإن أردت أن تكون أعبد الناس: فكن متمسكاً بقوله صلي الله عليه وسلم:\n" +
                "{ مَنْ يَأْخُذُ عَنِّي هذِهِ الْكَلِمَاتِ فَيَعْمَلَ بِهِنَّ أَوْ يُعَلِّمَ مَنْ يَعْمَلُ بِهِنَّ؟ فَقَالَ أَبُو هُرَيْرَةَ: قُلْتُ: أَنَا يَا رَسُولَ اللَّهِ، فَأَخَذَ بِيَدِي فَعَدَّ خَمْساً فَقَالَ: اتَّقِ الْمَحَارِمَ تَكُنْ أَعْبَدَ النَّاسِ، وَارْضَ بِمَا قَسَم اللَّهُ لَكَ تَكُنْ أَدْنَى النَّاسِ، وَأَحْسِنْ إلَى جَارِكَ تَكُنْ مُؤْمِناً، وَأَحِبَّ لِلنَّاسِ مَا تُحِبُّ لِنَفْسِكَ تَكُنْ مُسْلِماً، وَلاَ تُكْثِرِ الضَّحِكَ فَإنَّ كَثْرَةَ الضَّحِكِ تُمِيتُ الْقَلْبَ }. .\n" +
                "-\tوإن أردت أن تكن من المحسنين الخالصين: ....\n" +
                " فاعبد الله كأنك تراه، فإن لم تكن تراه فإنه يراك.\n" +
                "-\tوإن أردت أن يكمل إيمانك:.... فحسن خلقك.\n" +
                "-\tوإن أردت أن يحبك الله: ....فاقض حوائج إخوانك المسلمين ففي الحديث: {  إِذَا أَرَادَ اللَّهُ بِعَبْدٍ خَيْراً صَيَّرَ حَوَائِجَ النَّاسِ إِلَيْهِ }  \n" +
                "-\tوإن أردت أن تكـــون من المطيعين: ...فأدِّ ما فرض الله عليك.\n" +
                "-\tوإن أردت أن تلقى الله تعالى نقياً من الذنوب:.... فاغتسل من الجنابة، ....ولازم غسل الجمعة تلقى الله تعالى يوم القيامة وما عليك ذنب.\n" +
                "-\tوإن أردت أن تحشر يوم القيامة فى النور الهادى وتسلم من الظلمات: ....لا تظلمن أحداً من خلق الله تعالى.\n" +
                "-\tوإن أردت أن تقل ذنوبك:.... فالزم دوام الإستغفار.\n" +
                "-\tوإن أردت أن تكون أقوى الناس:.... فتوكل على الله.\n" +
                "-\tوإن أردت أن يستر الله تعلى عليك عيبك:... فاستر عيوب الناس فإن الله تعالى ستار ويحب من عباده الستارين.\n" +
                "-\tوإن أردت أن تمحى خطاياك: فأكثر من الاستغفار والخشوع والخضوع والحسنات فى الخلوات.\n" +
                "-\tوإن أردت الحسنات العظام: فعليك بحسن الخلق والتواضع والصبر على البلية.\n" +
                "-\tوإن أردت السلامة من السيئات العظام: فاجتنب سوء الخلق والشح المطاع.\n" +
                "-\tوإن أردت أن يسكن عنك غضب الجبار فعليك بإخفاء الصدقة وصلة الرحم.\n" +
                "-\tوإن أردت أن يقضى الله عنك: فقل ما قاله النبي صلي الله عليه وسلم للأعرابي حين سأله وقال صلي الله عليه وسلم له: { لَوْ كَانَ عَلَيْكَ مِثْلُ جَبَلِ صِيرٍ دَيْناً أَدَّاهُ الله عَنْكَ. قالَ «قُلْ اللَّهُمَّ اكْفِني بِحَلاَلِكَ عَنْ حَرَامِكَ، وَاغْنِني بِفَضْلِكَ عمن سِوَاكَ } ،. وفى الحديث: { اللَّهُمَّ فَارِجَ الهَم كَاشِفَ الغَم مُجِيبَ دَعْوَةِ المضطَّرينَ، رَحْمٰنَ الدُّنْيَا وَالآخِرَةِ وَرَحِيمَهُمَا أَنْتَ تَرْحَمُنِي فَارْحَمْنِي رَحْمَةً تُغْنِينِي بِهَا عَنْ رَحْمَةِ مَنْ سِوَاكَ } ( جامع الأحاديث والمراسيل عن عائشة).\n" +
                "-\tوإن أردت أن تنجو إذا وقعت فى هلكة فالزم ما فى الحديث إذا وقعت فى ورطة (الورطة: الهلاك) فقل: \"بسم الله الرحمن الرحيم ولا حول ولا قوة إلا بالله العلى العظيم\" فإن الله تعالى يصرف عنك ما شاء من أنواع البلاء.\n" +
                "-\tوقال: وإن أردت أن تأمن من قوم خفت شرهم فقل ما ورد فى الحديث: { اللَّهُمَّ إِنَّا نَجْعَلُكَ في نُحُورِهِمْ وَنَعُوذُ بِكَ مِنْ شُرُورِهِمْ }  ، ومنه { اللهم اكفناهم بما شئت إنك على كل شيء قدير }.\n" +
                "-\tوإن أردت أن تأمن إن خفت من سلطان فقل ما ورد:\n" +
                "\"لا إله إلا الله الحليم الكريم رب السموات السبع ورب العرش العظيم لا إله إلا أنت عز جارك وجل ثناؤك ولا إله إلا أنت\" ويستحب أن يقول بعد ما تقدم \"اللهم إنا نجعلك فى نحورهم إلى آخره\" وفى الحديث: { إذَا أَتَيْتَ سُلْطَانَاً مَهِيبَاً تَخَافُ أَنْ يَسْطُوَ بِكَ فَقُلْ: ٱللَّهُ أَكْبَرُ ٱللَّهُ أَكْبَرُ مِنْ خَلْقِهِ جَمِيعَاً، ٱللَّهُ أَعَزُّ مِمَّا أَخَافُ وَأَحْذَرُ }  والحمد لله رب العالمين..\n" +
                "-\tوإن أردت ثبات القلب على الدين فقد ورد مرفوعاً أنه كان من دعائه صلي الله عليه وسلم: { اللَّهُمَّ ثَبِّتْ قَلْبِي عَلَى دِينِكَ }  ، وروى: { يَا مُقَلبَ الْقُلُوبِ ثَبتْ قُلُوبَنَا عَلَى دِينِكَ }  .\n" +
                "-\tوقال: لمن دخل على سلطان يخاف شره: فليقرأ:\n" +
                " \uF07D \uF09A\uF0FA\uF0EF\uF0CF\uF025\uF0A9\uF021\uF024\uF023 \uF028\uF023\uF071\uF0E3\uF05Aرضي الله عنه\uF042\uF023\uF075\uF0E4 \uF034\uF092\uF06E\uF03Fرضي الله عنه\uF0E3\uF075صلي الله عليه وسلم \uF0F3\uF04F\uF0CE\uF067\uF0CE\uF06E\uF02F\uF075\uF091 رضي الله عنه\uF062\uF071\uF0E8\uF03D\uF09E\uF032\uF075\uF071رضي الله عنه\uF047رضي الله عنه\uF083 \uF07B [99النحل] ، \uF07D رضي الله عنه\uF0FB\uF0EF\uF0CF\uF025\uF0A9\uF021\uF024\uF023 رضي الله عنه\uF041\uF024\uF073\uF025 \uF0E3\uF04E\uF0DF\uF067\uF073\uF039 \uF0E2•\uF024•\uF05A\uF039\uF024\uF023 •\uF062\uF0CE\uF029 \uF07D•\uF024•\uF05A\uF039\uF024\uF023 \uF0F4\uF089\uF073\uF025 \uF028\uF023\uF071\uF0E3\uF0E8\uF075\uF04B\uF079\uF05F \uF0F6\uF04E\uF0E4\uF033\uF073\uF039 \uF0F6\uF04E\uF0E8\uF064\uF0F6\uF071رضي الله عنه\uF0B1\uF0F7\uF07A\uF024\uF024\uF073\uF0F9 \uF0F6\uF04E\uF0E8\uF064\uF079\uF08A\uF023رضي الله عنه\uF093\uF073\uF0F9 \uF024\uF059\uF05A\uF0BB\uF079\uF04A\uF083\uF0CE\uF029 \uF028\uF023\uF071\uF0E4\uF039\uF024\uF073\uF025\uF075صلي الله عليه وسلم \uF024\uF075\uF05A\uF0E7\uF036\uF0F3\uF0A1\uF079\uF06D \uF0AA\uF021\uF024\uF023 \uF07A\uF04E\uF0F7\uF0E8\uF0CF\uF052\uF075صلي الله عليه وسلم \uF0E3\uF040\uF08B\uF0C5\uF032\uF075\uF071\uF0F8\uF039\uF024\uF023 \uF0C7\uF0CA\uF0D0\uF0CC\uF0C8 \uF028\uF023\uF071\uF0E7\uF037\uF06E\uF03D\uF073\uF029\uF052\uF024\uF024\uF073\uF0F9 \uF037\uF070\uF079\uF04A\uF0F7\uF0E8\uF0CF\uF05A\uF0CE\uF02F \uF07A\uF060\uF0CF\uF069\uF042 \uF0AB\uF021\uF024\uF023 \uF039\uF040\uF0F4\uF0D2\uF073\uF0F9\uF075صلي الله عليه وسلم \uF0F6\uF04E\uF0A9\uF039 \uF0F6\uF04E\uF0E6\uF068\uF0F3\uF0A1\uF07C\uF0A1\uF0F4\uF04Aرضي الله عنه\uF083 \uF0D6\uF0E4\uF0FE\uF071\uF0DF\uF099 \uF028\uF023\uF071\uF0E3\uF0E8رضي الله عنه\uF037•\uF03F\uF024\uF023\uF075صلي الله عليه وسلم رضي الله عنه\uF062\uF0BA\uF075\uF071\uF0F4\uF0CA\uF0CD\uF091 \uF0AB\uF021\uF024\uF023 \uF033 \uF0AA\uF021\uF024\uF023\uF075صلي الله عليه وسلم صلي الله عليه وسلم\uF0E8\uF08C \uF040\uF040\uF0F4\uF0D2\uF073\uF0F9 \uF041\uF04F\uF08A\uF0CF\uF0E0رضي الله عنه\uF0E3 \uF0C7\uF0CA\uF0D0\uF0CD\uF0C8  \uF07B [آل عمران]\n" +
                "وقال رضى الله عنه:\n" +
                "-\tوإن أردت كثرة الخير والرزق فداوم على قراءة: \uF07D ألم نشرح \uF07B وقراءة سورة الكافرون.\n" +
                "-\tوإن أردت الستر من الناس: فداوم قول: \"اللهم استرني بسترك الجميل الذي سترت به نفسك فلا عين تراك\".\n" +
                "-\tوإن أردت عدم الجوع فداوم على قراءة: \uF07D \uF0C9\uF023\uF0BB\uF06E\uF03D\uF083\uF05C\uF07D \uF043•\uF0F7\uF083رضي الله عنه\uF08D\uF0E8\uF025 \uF0C7\uF0CA\uF0C8 \uF0F6\uF04E\uF0CE\uF067\uF0CF\uF0FF\uF0BB\uF073\uF039\uF0BE\uF0CE\uF029  \uF07B [قريش].\n" +
                "-\tوإن خفت على تجارتك أو مالك فاكتب سورة الشعراء وعلقها فى موضع تجارتك أو مالك يكثر البيع والشراء.\n" +
                "كما قال الشيخ رضوان الله تعالى عليه :\n" +
                "-\tمن كتب سورة القصص وعلقها على من يخاف عليه تلف فإنها أمان له من ذلك وهو سر لطيف مجرب.\n" +
                "-\tوقال: إذا تداين أحدكم فليتوجه بقلبه إلى الله تعالى ويتداين على الله تعالى فإن كل ما تداينه العبد على الله تعالى فعلى الله أداءه وإذا تداينت على نفسك أو على معلوم هو لك ثقل عليك أداءه. (المفاخر العلية 124)\n" +
                "وقال قدَّس الله روحه: \n" +
                "-\tوإذا توجهت إلى شيء من عمل الدنيا والآخرة فقل: \"ياقوي يا عزيز يا عليم يا قدير ياسميع يا بصير\".\n" +
                "-\tوإذا ورد عليك مزيد من الدنيا والآخرة فقل: \"حسبنا الله سيؤتينا الله من فضله ورسوله إنا إلى الله راغبون\"\n" +
                "وقال رحمه الله، وقد شكا إليه الناس ما هم فيه من ظلم فقال:\n" +
                "\"اللهم إنا براء من جور الجائرين وظلم الظالمين وإنا محبون لعدلك فلا تجر علينا بسخطك إنك على كل شيء قدير\"\n" +
                "وقال:\n" +
                "إذا أردت ألا يصدأ لك قلب ولا يلحقك هم ولا كرب ولا يبقى عليك ذنب فأكثر من قول: \"سبحان الله وبحمده سبحان الله العظيم، لا إله إلا الله، اللهم ثبت علمها فى قلبي واغفر لي ذنبي، واغفر للمؤمنين والمؤمنات وقل: الحمد لله وكفى وسلام على عباده الذين اصطفى\".\n" +
                "وقال : \n" +
                "-\tمن أردا أن يكون الله حسيبه ووكيله في جميع أموره ويكفيه شر جميع خلقه ويؤيده بنصره ويلقى محبته فى قلوب عباده ويعينه الله فليقل فى كل يوم وليلة:\n" +
                "1-\t \uF07D \uF024\uF075\uF05A\uF0E7\uF036\uF0F3\uF0A1\uF079\uF06D \uF0AA\uF021\uF024\uF023 \uF07A\uF04E\uF0F7\uF0E8\uF0CF\uF052\uF075صلي الله عليه وسلم \uF0E3\uF040\uF08B\uF0C5\uF032\uF075\uF071\uF0F8\uF039\uF024\uF023  \uF07B [173آل عمران] بعدد حروفها وفى رواية: \uF07D \uF09A\uF05F\uF0C9\uF03C\uF0F3\uF0A1\uF079\uF06D \uF0AA\uF021\uF024\uF023 \uF049\uF077 رضي الله عنه\uF06D\uF0BB\uF073\uF039\uF0CE\uF029 \uF09E\uF077\uF0CE\uF029 \uF075\uF071\uF0E8\uF064 \uF028 \uF0CF\uF06D\uF0F8\uF08B\uF06E\uF03Dرضي الله عنه\uF0E3 \uF0E0\uF04D\uF0F9\uF03D\uF09E\uF032\uF075\uF071\uF073\uF03F \uF028 \uF075\uF071\uF0E8\uF064\uF075صلي الله عليه وسلم \uF08F\uF03E\uF075\uF091 \uF0C4\uF0B8\uF0F6\uF08D\uF079\uF0E8\uF0F8\uF039\uF024\uF023 \uF0C9\uF04F\uF08A\uF0CF\uF0E0\uF079\uF0E8\uF0F8\uF039\uF024\uF023 \uF07B [129التوبة].\n" +
                "2-\tثم يقول بعد الذكر \uF07D \uF028\uF023\uF071\uF0E7\uF037\uF06E\uF03D\uF073\uF029\uF052\uF024\uF024\uF073\uF0F9 \uF037\uF070\uF079\uF04A\uF0F7\uF0E8\uF0CF\uF05A\uF0CE\uF02F \uF07A\uF060\uF0CF\uF069\uF042 \uF0AB\uF021\uF024\uF023 \uF039\uF040\uF0F4\uF0D2\uF073\uF0F9\uF075صلي الله عليه وسلم \uF0F6\uF04E\uF0A9\uF039 \uF0F6\uF04E\uF0E6\uF068\uF0F3\uF0A1\uF07C\uF0A1\uF0F4\uF04Aرضي الله عنه\uF083 \uF0D6\uF0E4\uF0FE\uF071\uF0DF\uF099  \uF07B ست مرات.\n" +
                "3-\tثم فى سابع مرة يقول: \uF07D \uF028\uF023\uF071\uF0E3\uF0E8رضي الله عنه\uF037•\uF03F\uF024\uF023\uF075صلي الله عليه وسلم رضي الله عنه\uF062\uF0BA\uF075\uF071\uF0F4\uF0CA\uF0CD\uF091 \uF0AB\uF021\uF024\uF023 \uF033 \uF0AA\uF021\uF024\uF023\uF075صلي الله عليه وسلم صلي الله عليه وسلم\uF0E8\uF08C \uF040\uF040\uF0F4\uF0D2\uF073\uF0F9 \uF041\uF04F\uF08A\uF0CF\uF0E0رضي الله عنه\uF0E3  \uF07B [174آل عمران]\n" +
                "وصلى الله على سيدنا محمد وعلى آله وصحبه وسلم.\n");
        text1.setTypeface(myfont);
    }
}
