package com.example.ahmedyehia.myapplication;

import android.graphics.Typeface;
import android.support.v7.app.AppCompatActivity;
import android.os.Bundle;
import android.widget.TextView;

public class Firstbook5 extends AppCompatActivity {

    TextView text1,text2;
    Typeface myfont;

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_firstbook5);

        myfont = Typeface.createFromAsset(this.getAssets(),"fonts/me_quran_volt_newmet.ttf");

        text1 = (TextView)findViewById(R.id.text1);
        text2 = (TextView)findViewById(R.id.text2);

        text1.setTypeface(myfont);
        text2.setTypeface(myfont);

        text1.setText("أسس دعوته رضي الله عنه \n وقد مارس رضي الله عنه دعوته على أسس صريحة اقام عليها طريقته.\n" +
                "وكان الأساس الأول هو العمل لتحصيل القوت، فاتخذ أرضاً للزراعة وماشية وأغناماً للرعى وأسس طريقته على أنه يكون لكل مريد حرفته وكان يسأل المريد قبل إعطائه العهد ألك حرفة؟ فإن قال: لا، رفض أن يعطيه عهده.\n" +
                "بل إنه أورث أصحابه العزة .....، وانظر إليه وهو يقول لسيدي أبو العباس المرسي: ... يا أحمد! لا تطلب من أحد شيئاً، وإذا أعطاك أحد شيئاً فلا تأخذ منه؟ قال أبو العباس: فقلت فى نفسي كيف لا أقبل وقد قبل رسول الله صلي الله عليه وسلم الهدية؟ فإذا به يقول لي:\n" +
                " كأنك تقول أن رسول الله قد قبل الهدية، إنه صلي الله عليه وسلم كان بالوحي، وكان لا يأخذ هدية إلا إذا أثاب عليها بمثلها أو خيراً منها، فإذا كنت بالوحي! وستثيب على الهدية بخير منها أو مثلها فافعل وإلا فدع.\n" +
                "فقد كان يخاطب المريدين بما فى سرائرهم ولا يحتاج إلى عرض مطالبهم حتى أنه كان إذا صلى يعرف الإلهامات التى وردت على خواطرهم أثناء الصلاة.\n" +
                "قال سيدي أبو العباس رضي الله عنه:\n" +
                "صلينا خلفه يوماً فقرأ فى \"الحواميم\" قول الله عزوجل: \uF07D \uF0DC\uF03D\uF070\uF06B\uF075\uF089 \uF060\uF079\uF04A\uF0CF\uF039 \uF0E2\uF0E4\uF021\uF024رضي الله عنه\uF0B1\uF06F\uF084 \uF024\uF05A\uF057\uF0BBرضي الله عنه\uF052\uF0CE\uF029 \uF0DC\uF03D\uF079\uF067رضي الله عنه\uF083\uF075صلي الله عليه وسلم \uF060\uF079\uF04A\uF0CF\uF039 \uF0E2\uF0E4\uF021\uF024رضي الله عنه\uF0B1\uF06F\uF084 \uF075\uF091\uF071\uF0E4\uF02E\uF097\uF025\uF021\uF024\uF023 \uF0C7\uF0CD\uF0D2\uF0C8 \uF0F7صلي الله عليه وسلمصلي الله عليه وسلم\uF026 \uF0F6\uF04E\uF0DF\uF067\uF0E3\uF05F\uF0CD\uF069صلي الله عليه وسلمرضي الله عنه\uF093\uF0E3\uF083 \uF024\uF05A\uF052\uF023رضي الله عنه\uF08D\uF0F8\uF02E\uF0E8\uF08C \uF024\uF05A\uF057\uF0BBرضي الله عنه\uF052\uF0CE\uF029\uF075صلي الله عليه وسلم \uF028 \uF0E3\uF040\uF079\uF0E8\uF0F8\uF067\uF073\uF086\uF075صلي الله عليه وسلم \uF060رضي الله عنه\uF042 \uF0E2\uF0E4\uF021\uF024رضي الله عنه\uF0B1\uF06F\uF084 \uF024\uF0B8\uF04A\uF08B\uF0C9\uF029رضي الله عنه\uF0E3  \uF07B [الشورى]، وإذا به يحدثني بعد الصلاة عن الخواطر التى جاءتنى أثناء الصلاة ويقول: يا أحمد لقد فهمت من الآية كذا وكذا، فتعجبت، قال: وفهم فلان منها كذا وفهم فلان منها كذا وذكر ما فهمناه جميعاً فى الآيات التى تلاها علينا ونحن فى الصلاة ... إنها بصيرة وسريرة نيرة منيرة .\n" +
                "إذاً فقد أسس دعوته على العمل ولذلك كان تلميذه ووارث حاله أبوالعباس يقول لتلاميذه:\n" +
                "\"ليكن مسبحة أحدكم مكوكه أو خيطه وإبرته أو قدومه\"، وذلك لأن \uF07D \uF0AC\uF021\uF075صلي الله عليه وسلم \uF0E4\uF06F•\uF093\uF0CF\uF0E8\uF0F8\uF039\uF024\uF023 \uF0BE\uF0CF\uF026\uF0CE\uF021\uF071\uF0DF\uF099رضي الله عنه\uF08D\uF0CF\uF039\uF075صلي الله عليه وسلم \uF09A\uF0FA\uF0FC\uF0CF\uF05A\uF0CF\uF042\uF0F7\uF073\uF0DF\uF04A\uF0F9\uF03D\uF0CF\uF039\uF075صلي الله عليه وسلم  \uF07B [8 المنافقون] تكون بالعمل.\n" +
                "ومع الدعوة آلى على نفسه أن يقضى حوائج الخلق فكان يشفع عند الولاة وعند الحكَّام فى حوائج الناس البسطاء ليقضيها لهم وقال فى ذلك:\n" +
                "\"حدثتنى نفسي يوماً أن فى التعرض لحاجات الخلق شغلاً عن الحق والخلوة بحضرته، وإذا بي أرى نفسي فى بحر عميق تحيط بى المياه من كل جانب ولا أرى براً فى أي جهة من الجهات أستطيع أن أخرج منه فوقفت صلباً والامواج تحيط بي ولكن ثبتني الله فلا أستطيع أن أخرج ولا تستطيع الأمواج أن تغرقني وإذا بقائل يقول لي: إن من أجَّل أعمال أهل الفتح قضاء حوائج الخلق طلباً لمرضاة الله عزوجل\"\n" +
                " فكان رضي الله عنه يقضي مصالح الخلق حتى روى ابن عطاء الله السكندري رضي الله عنه: أنه سمع الشيخ تقى الدين بن دقيق العيد يقول: \"جهل ولاة الأمور بقدر الشيخ أبى الحسن الشاذلى رضي الله عنه لكثرة تردده فى الشفاعات\"، مع أنه لا يريد إلا وجه الله عزوجل.\n" +
                "فقد ذهب إليه عامل بسيط يعمل فى دائرة القاضى وطلب منه أن يشفع له عند القاضى لزيادة راتبه، فذهب إلى القاضى تاج الدين بن بنت الأعز فعظمه القاضى واحتفى به فقال: لقد جئت إليك من أجل زيادة راتب فلان عشر دريهمات، قال: يا سيدي إنه يأخذ كذا وكذا فقال: يا تاج أتستكثر عليه عشر دريهمات؟ إن الله عزوجل لم يستكثر على أى مؤمن الجنة حتى زاده النظر إلى وجهه الكريم!!\n" +
                "وانظر إلى الحجة والعرض اللطيف!! فكان يذهب لقضاء حوائج الخلق طلباً لمرضاة الحق عزوجل وربما كان من أسرار انتشار الصوفية فى الأزمان الماضية قضاء مصالح الخلق، فلقد كان الصوفية هم الأولياء الذين يُغنون الفقراء عن تذللهم على أبواب الأقوياء والأغنياء ويقضون جميع حوائجهم.\n" +
                "وجعل رضي الله عنه كعهده أساس طريقه فى العلم فجعل داره فى الإسكندرية معهداً للعلم وكانت طريقته فى تدريس العلم – دراسة الكتب العظمى فى ذاك الوقت لطلابه – وكانت طريقة منهجية نمشي عليها نحن الآن فنحن ننادى إخواننا الدعاة أن يأخذ الواحد منهم كتاباً يتناوله بالترتيب للأحباب كما كان يفعل سيدي أبى الحسن الشاذلى، فكان يُدرِس كتاب \"إحياء علوم الدين\" للإمام الغزالى ويقول عنه: \"كتاب الإحياء يورث العلم\"، وكان يُدرِّس كتاب: \"قوت القلوب\" لأبي طالب المكى، ويقول كتاب القوت يورث النور، وكان يدرس كتاب الرسالة للإمام القشيري فى التصوف، وكان يدرس فى التفسير كتاب \"المحرر الوجيز فى تفسير كتاب الله العزيز\" لابن عطية الأندلس.\n" +
                "كان يدرس كل هذه الكتب العظيمة الشاملة الجامعة لتلاميذه الأجلاء ومشى على هذا النهج تلميذه النجيب أبو العباس المرسى رضي الله عنه لما أذن له وجلس بين يديه فى مسجد العطارين وقال: تكلم يا أبا العباس .. تكلم ولن تكف بعدها أبداً.\n" +
                "وكان لا يأذن للمريد بالحديث إلا إذا فُتح له باب الإلهام ويقول: \"حدثونا بما فتح الله عليكم ولا تحدثونا عن غيركم\".\n" +
                "وشاطره بذلك الإمام أبو العباس الدعوة وطلب منه أن يتوجه للقاهرة ليكون نائبه فى نشر الدعوة فى القاهرة ، وأقام فى مسجد أولاد عنان وهو مسجد رمسيس الآن ينشر دعوة الله عزوجل، وكان يدرس من الرسالة القشيرية وهذه الرسالة تبدأ عادة أى باب بحديث شريف عن الحبيب صلي الله عليه وسلم فيطلب من أحد أحبابه أن يقرأ الحديث فقط، ثم يشرح الحديث بما فتح الله عليه شرح عرفانى إلهامى لا يعلم مداه إلا الله.\n" +
                "ومع ذلك كان من شدة شوقه إلى شيخه ورغبته فى الحضور بين يديه كان إذا بدأ الشيخ درسه فى بيته بالاسكندرية يحضر الدرس وهو فى القاهرة ويشير الشيخ إلى ذلك ويقول هذا أبو العباس يحضر معكم هذا الدرس، إذاً فأساسنا هو العلم لأنه لا عبادة صحيحة إلا إذا أسست على علم صحيح.\n" +
                "بذلك قد جعل منهجه:\n" +
                " أولاً السعي إلى تحصيل الرزق وكل من أراد أن يتفرغ ينهاه عن ذلك، وقد ذهب إليه يوماً أبو العباس رضي الله عنه - قال:\n" +
                "\" ذهبت إليه وفى نفسي أن أزهد فى الدنيا وأترك ما أنا فيه وأتفرغ إليه فإذا به يقول لى: يا أبا العباس إعرف الله وكن كيف شئت\"\n" +
                "ثانياً: طلب العلم .\n" +
                " ثالثاً: السعى فى قضاء مصالح العباد.\n");

        text2.setText("كما كان له دور عظيم فى الجهاد وقد أصيب بمرض في عينه وكف بصره، ومع ذلك عندما جاء لويس التاسع ومن معه من الفرنسيين إلى مصر ودخلوا دمياط ثم بعدها تحركوا إلى المنصورة وكانت فترة عصيبة فقد كان الملك الصالح أيوب ملك مصر والشام فى ذاك الوقت فى بلاد الشام، وكان مريضاً فجاء رغم مرضه إلى المنصورة، ومات أثناء المعركة وظهر دور زوجته شجرة الدر التى أخفت موته ولم تُعلم إلا قائد الجيوش وجمعت قادة الجند وقالت إن الملك كما تعلمون مريض لا يستطيع أن يقابل أحداً ويأمركم أن تبايعوا فخر الدين قائد الجيش وتكونوا طوع أمره فبايعوه.\n" +
                "وأرسلت تستدعى ابنه توران شاه من بلاد الشام ولم يعلن نبأ وفاة الملك إلا بعد مجيء ابنه ومبايعته بالملك، لكن ابنه الملك كان بعيداً عن السياسة ولا يملك الأهلية لهذا الأمر.\n" +
                "كل هذه المشاق قد تحملها العلماء الأجلاء فى ذاك الوقت، فقد ذهب أبوالحسن وهو كفيف البصر وكذلك العز بن عبدالسلام والشيخ مجد الدين القشيري والشيخ ابن دقيق العيد والشيخ ابن سراقة وغيرهم وكانوا يقضون يومهم فى المرور بين الجند وكانوا سلاح التوجيه المعنوى كما يطلق عليه الآن فقد كان عليهم رفع الروح المعنوية للجند طوال اليوم.\n" +
                "فإذا جاء الغروب جلسوا فى خيمة يتدارسون فى كتاب من كتب الدين وكان هذا حالهم وقد مكثوا فى ذلك فترة طويلة تزيد عن الشهرين – ويحكى الشيخ مكين الدين الأسمر تلميذه النجيب رضي الله عنه ويقول كما أخبر عنه ابن عطاء الله السكندري: حضرت مجلساً فيه الشيخ أبو الحسن ومن ذكرناهم سابقاً وأخذوا يتحدثون فى أمر من أمور العلم والشيخ أبو الحسن صامت لا يتكلم فقالوا له نريد أن تدلى بدلوك فقال: أنتم شيوخ الوقت وعلماء العصر – وانظر إلى تواضع الاولياء؟ - فقالوا: لابد، فبدأ الحديث وكأنه يغترف من الغيب حتى تأثر الشيخ عز الدين بن عبدالسلام شيخ الإسلام فى ذلك الوقت وخرج لأنه لم يستطع أن يتمالك نفسه ووقف أمام الخيمة وأخذ يضرب بكفيه ويصيح: \"هلموا استمعوا إلى هذا العلم الحديث عهد بالله عزوجل\" .\n" +
                "واهتم الشيخ بالثغر بشدة وقد قال صلي الله عليه وسلم:\n" +
                "{ ومَنْ لَمْ يَهْتَمَّ بالمُسْلِمِينَ فَلَيْسَ مِنْهُمْ } \n" +
                "يقول:\n" +
                "وفى ليلة الثامن من شهر ذي الحجة نمت مهموماً وإذا بى أرى خيمة عظيمة فيها رسول الله صلي الله عليه وسلم وأمامها حوالى سبعون من الصالحين أعرف منهم الشيخ عز الدين بن عبدالسلام وابن دقيق العيد والشيخ القشيري فتقدمت وبى فرح وغم – فرح لأنى سأرى رسول الله صلي الله عليه وسلم وغم من أجل الوضع الذي فيه المسلمون الآن، فطلبوا منى أن أدخل فقلت: لا ينبغي أن أتقدم على شيخ الإسلام الشيخ عز الدين بن عبدالسلام، فأشار رسول الله صلي الله عليه وسلم للجميع أن يجلسوا، وتقدمت فقال: مالي أراك مهموماً، قلت: يا سيدي من أجل الثغر ومن أجل السلطان ومن أجل المسلمين، قال: أما الثغر فلا تهتم من أجله، وأما السلطان فكاتبه وناصحه، وأما المسلمين: \uF07D \uF060رضي الله عنه\uF042\uF075صلي الله عليه وسلم \uF0A4\uF041\uF075\uF071رضي الله عنه\uF047رضي الله عنه\uF083 \uF0A9\uF021\uF024\uF023 \uF0BC\uF0E3\uF026\uF073\uF021\uF071\uF0DF\uF099\uF075\uF091\uF075صلي الله عليه وسلم رضي الله عنه\uF0FB\uF0EF\uF0CF\uF025\uF0A9\uF021\uF024\uF023\uF075صلي الله عليه وسلم \uF028\uF023\uF071\uF0E3\uF05Aرضي الله عنه\uF042\uF023\uF075\uF0E4 •\uF062\uF0CE\uF02A\uF073\uF0F9 \uF07A\uF03E\uF0F7\uF093\uF0CF\uF06D \uF0AB\uF021\uF024\uF023 \uF0DE\uF04F\uF0E8\uF064 رضي الله عنه\uF062\uF071\uF0E7\uF037\uF0CE\uF03D\uF0BBرضي الله عنه\uF0F3\uF0F8\uF039\uF024\uF023 \uF0C7\uF0CE\uF0CF\uF0C8 \uF07B [المائدة]، قال: فانتبهت من نومى وأنا أقول نُصرنا ورب الكعبة ، وكان النصر، وهكذا دائماً حال الأقطاب والوارثين فى كل زمان ومكان.\n" +
                "وعلى سبيل التذكرة أذكر فى هذا المجال شيخنا الشيخ محمد على سلامة رضي الله عنه وكان ذلك فى عام 1973م عندما بشرنا فى بدايتها بالنصر وقال: رٍأيت رسول الله صلي الله عليه وسلم فى مسجد فى سيناء وعلى باب المسجد سيدي إبراهيم الدسوقى وسيدي أحمد البدوي فاستأذنت فى الدخول فأُذن لى، وحادثت رسول الله صلي الله عليه وسلم فى شأن المسلمين، فقال: أبشر يا بني فقد أطفأوها، قال: فأخذت أقفز حتى لامست رأسى سقف المسجد وأنا أصيح يابشراى! يا بشراى! فعلمت أن النصر آت لا ريب فيه فى هذا العام، وقد كان.\n" +
                "فكان الإمام أبو الحسن رضي الله عنه يحارب وهو كفيف ليرفع الروح المعنوية للجند والمقاتلين من المسلمين، وكان كذلك يعمل كل ما فى وسعه لإصلاح حال الأمة وإعلاء شأن أهلها بالصفاء والنقاء ونشر الحب والوداد فى قلوب الأفراد – وذلك لأنه لن ينصلح حال أمة إلا إذا إنتُزع الحقد والغل والحسد من قلوب أهلها ووضع مكانه الحب فيما بينهم لجميع إخوانهم وهذه آفة المسلمين فى هذا الزمان.\n" +
                "وظل رضي الله عنه يدعو إلى الله على بصيرة حتى وافته منيته.\n" +
                "وكان قد قال لإخوانه قبل وفاته: \"عليكم بأبى العباس فهو الخليفة عليكم من بعدي وهو باب من أبواب الله عزوجل\".\n" +
                "وهنا أساس آخر قد وضعه للصالحين الصادقين فقد كان عنده ثلاثة أولاد ذكور ولكنه لم يعطِ الخلافة لواحد منهم وأعطاها لأبى العباس، وكذلك سار أبو العباس من بعده إذ كان عنده ولدان ولكنه أعطى الخلافة لياقوت العرشى، وكذلك ياقوت العرشى أعطى الخلافة لأحمد بن عطاء الله السكندري .. وصارت الطريقة الشاذلية على هذا النهج الصحيح الوراثة لأكمل الناس حالاً وأعلاهم مقاماً وأرفعهم شأناً عند الله عزوجل وذلك لأنها وراثة طريقة الله عزوجل ولا بد أن يكون قائد المسيرة بصير ...\n" +
                "أيجوز أن يقود أعمى مبصرين! فإذا كان المرء أعمى البصيرة! فكيف يقود المبصرين فى طريق رب العالمين عزوجل.\n" +
                "فهذه هي الأسس التى وضعها سيدي أبوالحسن الشاذلى رضي الله عنه - نهجه فى طريقته ومنهجه فى تربية مريديه .\n" +
                "ولكل طريقة نهج، فطريقة سيدي أحمد الرفاعى رضي الله عنه فى تربية أولاده الذل والمسكنة والخدمة، خدمة الفقراء وخدمة المرضى وخدمة المساكين ولذلك تجد أن كثيراً من السادة الرفاعية يحملون القرب على ظهورهم فى المساجد ويسقون رواد المسجد وذلك لأن منهجهم الخدمة.\n" +
                "وطريقة سيدي عبدالقادر الجيلاني هى الجهاد الشديد للنفس كالسياحة فى البرارى والقفار وأخذ النفس بشظف العيش والجد فى العبادة وعدم التوانى عن طاعة الله.\n" +
                "أما سيدي أبو الحسن الشاذلى رضي الله عنه فقد وضع نهجاً أقرب ما يكون إلى نهج أصحاب رسول الله صلي الله عليه وسلم الكمَّل فنهجه هو:\n" +
                "-\tالمحافظة على الفرائض فى وقتها فى جماعة فى بيت الله ولذلك يقول: \"إذا رأيت من لا يحافظ على الفرائض فى وقتها فى جماعة فى بيت الله فلا تعبأ به فلن يؤتى منه خيراً قط\" .\n" +
                "-\tوالقيام بالفرائض والواجبات واجتناب المعاصى بالكلية.\n" +
                "-\t ثم بعد ذلك تصفية النفس بإزالة الأوصاف الذميمة وتحليتها بالأخلاق الكريمة.\n" +
                "ولذلك قالوا: \"بدايتنا نهاية الطرق الأخرى\"، فبداية الطرق الأخرى الجهاد ونهايتها التخلية والتحلية .. أما نحن فالبداية عندنا التخلية والتحلية، تخلية النفس من صفاتها الذميمة، وتحليتها بالصفات الكريمة، وهذا هو الجهاد الأعظم للمريدين؛ استحضار عظمة الله عزوجل ومراقبته فى كل وقت بحيث يرى أنه لا يغيب عنه طرفة عين ... وأن الله يرى ظاهره .. وباطنه ... ويطلع على سره ... وجهره ... والإكثار من ذكر الله عزوجل على هذه الحالة.\n" +
                "أما منهج سيدى أبى الحسن الشاذلى فى المأكل والمشرب والملبس؛ فيحتاج إلى إيضاح ووبيان وتفصيل حتى لا تختلط الأوراق ويستبين الحق !!\n" +
                "كان سيدى أبو الحسن الشاذلى جميل المظهر، عذب الحديث، فصيح اللسان، غير متزمت فى المأكل والمشرب، يحب الخيل ويقتنيها، ويركبها فارساً، ويركبها فى المواسم الدينية، يقول أبوالعزايم ماضى يصفه رضي الله عنه:\n" +
                "\"كانت صفته رضي الله عنه، آدم اللون، نحيف الجسم، طويل القامة، خفيف العارضين، طويل أصابع اليدين كانه حجازى، وكان فصيح اللسان، عذب الكلام\".\n" +
                "يقول الأستاذ على سالم عمار: \"كان الشاذلى يلبس الفاخر من الثياب، ويركب الفاره من الدواب، ويتخذ الخيل الجياد\" .\n" +
                "غير أن ضابطه فى ذلك مراعاة القصد والإعتدال عملاً بقول الله تعالى: \uF07D رضي الله عنه\uF0FB\uF0EF\uF0CF\uF025\uF0A9\uF021\uF024\uF023\uF075صلي الله عليه وسلم \uF021\uF023\uF073\uF08C\uF0CE\uF029 \uF028\uF023\uF071\uF0E0\uF029\uF078\uF0FF\uF052صلي الله عليه وسلم\uF026 \uF0F6\uF04E\uF073\uF039 \uF028\uF023\uF071\uF0E8\uF0F9\uF0CC\uF08D\uF0F3\uF0A1\uF0E7\uF084 \uF0F6\uF04E\uF073\uF039\uF075صلي الله عليه وسلم \uF028\uF023صلي الله عليه وسلم\uF0E7\uF08E\uF0E4\uF049\uF0F8\uF029رضي الله عنه\uF083 رضي الله عنه\uF062\uF025\uF09F\uF032\uF075صلي الله عليه وسلم \uF09A\uF0FA\uF0F7\uF0FCرضي الله عنه\uF02F \uF09A\uF081\uF0CF\uF039\uF0BA\uF073\uF08C \uF024\uF059\uF042\uF023\uF075\uF071\uF073\uF025 \uF0C7\uF0CF\uF0D0\uF0C8 \uF07B [الفرقان]، وتأسياً بقوله صلي الله عليه وسلم:\n" +
                "{ كُلُوا وَتَصَدَّقُوا وَالْبَسُوا فِي غَيْرِ إسْرَافٍ وَلاَ مَخِيلَةٍ }  \n" +
                "ولذلك كان ينصح المريدين دائماً بالإعتدال فيقول:\n" +
                " \"لا تسرف بترك الدنيا، فتغشاك ظلمتها !!!، أو تخلِّ أعضاؤك لها، فترجع لمعانقتها بعد الخروج منها، بالهمة !!!  أو بالفكرة !!!،\n" +
                " أو بالإرادة !!! أو بالحركة !!!\" \n" +
                "ويبين ابن عطاء الله نهج الطريقة الشاذلية، الذي رسمه سيدى أبو الحسن الشاذلى رضي الله عنه فيقول:\n" +
                "\" وأما لبس اللباس اللين ...، وأكل الطعام الشهى ...، وشرب الماء البارد ... ، فليس القصد إليه بالذي يوجب العتب من الله ...\n" +
                "إذا كان معه الشكر لله \".\n" +
                "وهذا ما يطابق قول الله عزوجل: \uF07D \uF0F6\uF040\uF0E8\uF025 \uF0F4\uF060رضي الله عنه\uF042 رضي الله عنه\uF050\uF0A7\uF08D\uF079\uF06D \uF073\uF070\uF06F\uF059\uF083\uF0CE\uF097 \uF0AB\uF021\uF024\uF023 \uF0FB\uF0D3\uF0C9\uF04C\uF0A9\uF039\uF024\uF023 \uF079\uF06Cرضي الله عنه\uF08D\uF0F7\uF07Aصلي الله عليه وسلم\uF026 \uF0BE\uF0CD\uF06E\uF0CF\uF08A\uF024رضي الله عنه\uF037\uF0CF\uF0E8\uF0CF\uF039 \uF0CF\uF04D\uF0BBرضي الله عنه\uF036\uF0CD\uF068\uF08B\uF0A9\uF0DC\uF039\uF024\uF023\uF075صلي الله عليه وسلم \uF07A\uF060\uF0CF\uF042 \uF0C9\uF02D\uF0F8\uF097\uF0CC\uF068\uF08D\uF039\uF024\uF023 \uF034 \uF0F6\uF040\uF0E8\uF025 \uF07D\uF091\uF0CF\uF064 رضي الله عنه\uF0FB\uF0EF\uF0CF\uF025\uF0A9\uF023\uF0CF\uF039 \uF028\uF023\uF071\uF0E3\uF05Aرضي الله عنه\uF042\uF023\uF075\uF0E4 \uF092\uF0CE\uF0FB \uF0CD\uF06F\uF034\uF071\uF075\uF08A\uF079\uF073\uF0F8\uF039\uF024\uF023 \uF024\uF075\uF08B\uF0F7\uF052\uF091\uF089\uF039\uF024\uF023 \uF05A\uF070\uF07C\uF0C1\uF0CF\uF039\uF025\uF073\uF07B رضي الله عنه\uF050\uF0F6\uF071رضي الله عنه\uF083 \uF0CF\uF070\uF079\uF04A\uF0BB\uF075\uF08A\uF0C9\uF029\uF0F8\uF039\uF024\uF023  \uF07B [32الأعراف].\n" +
                "ولذا فقد روى أن أبا العباس المرسى دخل على الشيخ أبى الحسن، وفى نفسه أن يأكل الخشن، وأن يلبس الخشن، فقال له الشيخ:\n" +
                " يا أبا العباس، اعرف الله وكن كيف شئت.\n" +
                "فمن عرف الله، فلا عليه إن أكل هنيئاً، أو شرب مريئاً، يقول الدكتور عبدالحليم محمود فى كتابه أبو الحسن الشاذلى:\n" +
                "\"وما كان أبوالحسن الشاذلى يتعمد قط أن يأكل الغليظ من الطعام، أو يقتصر على الزلال البارد من الشراب. إنه يقول: \"يا بنى برّد الماء، فإنك إذا شربت الماء الساخن فقلت الحمد لله، تقولها بكزازة، وإذا شربت الماء البارد، فقلت الحمد لله استجاب كل عضو منك بالحمد لله، كان يتحدث وجاء رجل يتشبه بالزهاد وقال: يا سيدي حالك هذا لا يشبه الزاهدين فقال رضي الله عنه: يا هذا حالى هذا يقول الحمد لله! وحالك هذا يقول للخلق: أعطونى شيئاً لله \".\n" +
                "\"وإذا جاء الحرُّ يقول لخادمه: \" يا بني بَرِّد الشراب فإن النفس لو شربت الماء البارد تقول الحمد لله بكل عروقها وإذا شربت الماء الساخن تقول الحمد لله بكزازة نفس \".\n" +
                "ولذلك فإن منهج الشاذلية هو المنهج العظيم:\n" +
                "\" كل أشهى الطعام ... وأشرب أفخر الشراب ...، وألبس أجمل الثياب ...، وتزوَّج أجمل النساء .... على أن يكون ذلك كله من حلال !!!، وتشكر الله عزوجل على ذلك!!!، ثمَّ - وهو أهم ما فى طريقه بعد ذلك وهو سرُّ العناية وسبيل الولاية - التبرِّى من الحول والطول ونسبة كل منَّة ونعمة إلى الله عزوجل.\"\n" +
                "بل هو الأساس الذي به الفتوحات .... أن يتبرأ الإنسان من حوله وطوله وقوله وعلمه وينسب كل فضل عنده إلى به عزوجل.\n" +
                "وأما عن الزى، فلما سأله مريدوه عن الزّي الخاص بطريقته قال:\n" +
                "\" عليكم بالثياب البيض فقال: قال صلي الله عليه وسلم: { خَيْرُ ثِيَابِكُمْ الْبَيَاضُ. فَالْبَسُوهَا، وَكَفِّنُوا فِيهَا مَوْتَاكُمْ }  \"\n" +
                "فاختار البياض ، وكان يأمر أصحابه إذا أرادوا أن يتزيوا بزىٍّ خاص أن يلبسوا الأبيض.\n" +
                "قال الشيخ ابن عطاء الله رضي الله عنه فى لطائف المنن:\n" +
                "\"كان مبنى طريقة الشيخ رضي الله عنه على الجمع على الله، وعدم التفرقة، وملازمة الخلوة والذكر، وكان لكل مريد معه سبيل يحمله عليه فيسلك بكل أحد من السبيل الذي يناسبه، وكان يأمر أصحابه بالجمع على محبته، وكان لا يأمر أحداً بترك حرفته أو تجارته، بل يعرفه الطريق وهو باق على حالته، وكان يكره كل لبْسٍ ينادى على سرِّ صاحبه بالإفشاء ، وكان يقول (نقلاً) عن شيخه : اصحبونى ولا أمنعكم أن تصحبوا غيري، فإن وجدتم منهلاً أعذب من هذا المنهج فاذهبوا إليه، وكان لا يحبُّ المريد الذي لا سبب له ( لا عمل له)، والسادة الشاذلية \uF079 أشدُّ المشايخ حثَّاً على عمل الحرفة، حتى كان الشيخ أبو العباس المرسى يقول: عليكم بالسبب، وليجعل أحدكم مكوكه سبحته أو تحريك أصابعه فى الخياطة سبحته أو الضفر.\n");


    }
}
